
Функция ПроверкаОбновленияПрограммы() Экспорт
	
	ДанныеВозврата = Новый Структура;
	Попытка
		ЗапросHTTP = Новый HTTPЗапрос;
		ЗапросHTTP.АдресРесурса = "updates/tt_update";
		Соединение = Новый HTTPСоединение("www.ttclubrating.ru");
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		Стр = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ДанныеВозврата.Вставить("ОбновлениеПрошло",Истина);
		ДанныеВозврата.Вставить("Описание",Стр);
	Исключение
		ДанныеВозврата.Вставить("ОбновлениеПрошло",Ложь);
		ДанныеВозврата.Вставить("Описание",ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ДанныеВозврата;
	
КонецФункции

