
&НаКлиенте
Процедура ДекорацияШапкаНажатие(Элемент)
	НачатьЗапускПриложения(Неопределено, "http://ttfr.ru/rus/pravila-nastolnogo-tennisa/");
КонецПроцедуры

&НаКлиенте
Процедура Декорация0Нажатие(Элемент)
	ОткрытьФайлМакета("ПолныеПравила",".pdf");
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ОткрытьФайлМакета("1",".pdf");
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	ОткрытьФайлМакета("2",".pdf");
КонецПроцедуры

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	ОткрытьФайлМакета("3",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	ОткрытьФайлМакета("4",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация5Нажатие(Элемент)
	ОткрытьФайлМакета("5",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация6Нажатие(Элемент)
	ОткрытьФайлМакета("6",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация7Нажатие(Элемент)
	ОткрытьФайлМакета("7",".pdf");
КонецПроцедуры

&НаКлиенте
Процедура Декорация8Нажатие(Элемент)
	ОткрытьФайлМакета("8",".pdf");
КонецПроцедуры

&НаКлиенте
Процедура Декорация9Нажатие(Элемент)
	ОткрытьФайлМакета("9",".xls");
КонецПроцедуры

&НаКлиенте
Процедура Декорация10Нажатие(Элемент)
	ОткрытьФайлМакета("10",".xls");
КонецПроцедуры

&НаКлиенте
Процедура Декорация11Нажатие(Элемент)
	ОткрытьФайлМакета("11",".xls");
КонецПроцедуры

&НаКлиенте
Процедура Декорация12Нажатие(Элемент)
	ОткрытьФайлМакета("12",".xls");
КонецПроцедуры

&НаКлиенте
Процедура Декорация13Нажатие(Элемент)
	ОткрытьФайлМакета("13",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация14Нажатие(Элемент)
	ОткрытьФайлМакета("14",".pdf");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлМакета(парНомер,парРасширение)
	
	#Если Не ВебКлиент Тогда
		Попытка

			ИмяВТФайла = ПолучитьИмяВременногоФайла(парРасширение);

			ДДДанныеФайла = ПолучитьНужныйМакет(парНомер);
			ДДДанныеФайла.Записать(ИмяВТФайла);
			СписокФайлов.Добавить(ИмяВТФайла);

			НачатьЗапускПриложения(Новый ОписаниеОповещения("ПослеОткрытияФайла", ЭтотОбъект), ИмяВТФайла);

		Исключение
			ПоказатьОповещениеПользователя("Внимание", , "Не удалось открыть файл !", БиблиотекаКартинок.Ошибка);
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
//@skip-warning
Процедура ПослеОткрытияФайла(КодВозврата,ДопПараметры) Экспорт
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНужныйМакет(парНомер)
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	Если парНомер = "ПолныеПравила" Тогда
		ДвоичныеДанныеМакета = мОбъект.ПолучитьМакет("ПолныеПравила");
	ИначеЕсли парНомер = "РуководствоОфЛиц" Тогда 
		ДвоичныеДанныеМакета = мОбъект.ПолучитьМакет("РуководствоОфЛиц");
	Иначе
		ДвоичныеДанныеМакета = мОбъект.ПолучитьМакет("Приложение"+парНомер);
	КонецЕсли; 
	
	Возврат ДвоичныеДанныеМакета;
		
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Для каждого ТекСтр Из СписокФайлов Цикл
		Попытка
			НачатьУдалениеФайлов(,ТекСтр.Значение);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
			Сообщение.Текст = "Не удалось удалить временный файл";
			Сообщение.Сообщить();
		КонецПопытки; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Декорация16Нажатие(Элемент)
	ОткрытьФайлМакета("РуководствоОфЛиц",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация17Нажатие(Элемент)
	ОткрытьФайлМакета("A",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация18Нажатие(Элемент)
	ОткрытьФайлМакета("B",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация19Нажатие(Элемент)
	ОткрытьФайлМакета("C",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация20Нажатие(Элемент)
	ОткрытьФайлМакета("D",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация21Нажатие(Элемент)
	ОткрытьФайлМакета("E",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация22Нажатие(Элемент)
	ОткрытьФайлМакета("F",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация23Нажатие(Элемент)
	ОткрытьФайлМакета("G",".doc");
КонецПроцедуры

&НаКлиенте
Процедура Декорация24Нажатие(Элемент)
	ОткрытьФайлМакета("H",".doc");
КонецПроцедуры
 
