
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузкаРейтинга = 1;
	ВариантЗагрузки = 1;
	
	Макет = ПолучитьОбщийМакет("ДанныеДляЗагрузки");
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Защита = Истина;
	ТабДокДанных.Вывести(ОбластьШапки);
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл с данными";
	Диалог.ИндексФильтра = 0;
	Диалог.МножественныйВыбор =Ложь;
	Диалог.Фильтр    = "Excel 2007...  (*.xlsx)|*.xlsx|Excel 2003 (*.xls)|*.xls|Табличный документ (.*mxl)|*.mxl";
	Диалог.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Файл = Новый Файл(Диалог.ПолноеИмяФайла);
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		ЗагрузитьФайлВТабличныйДокумент();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлВТабличныйДокумент()
	
	ТабДокЗагрузки = Новый ТабличныйДокумент;
	ТабДокЗагрузки.Прочитать(ПутьКФайлу,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	ТабДокДанных.Очистить();
	
	Макет = ПолучитьОбщийМакет("ДанныеДляЗагрузки");
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Защита = Истина;
	ТабДокДанных.Вывести(ОбластьШапки);
	ТабДокДанных.Вывести(ТабДокЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьЗапускПриложения(Неопределено, ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	Данные = Новый Структура;
	Данные.Вставить("ЗагружатьИЗФайлаРейтинг",ЗагрузкаРейтинга);
	Данные.Вставить("СоздаватьУчастника",СоздаватьНовогоУчастника);
	Данные.Вставить("ТаблицаЭкспорта",ТаблицаЭкспорта);
	Данные.Вставить("ВариантЗагрузки",ВариантЗагрузки);
	Данные.Вставить("ТабДокДанные",ТабДокДанных);
	ЭтотОбъект.Закрыть(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов();	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	Если ВариантЗагрузки = 0 Тогда  //из excel
		Элементы.ГруппаЗагрузкаИзЭксель.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗагрузкаИзЭксель.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
 