&НаКлиенте
Перем глСтароеЗначениеКолонки;
&НаКлиенте
Перем глЗачеркнутыйШрифт;
&НаКлиенте
Перем глТекущийНомерСтола;
&НаКлиенте
Перем мЗакрытиеФормы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	//заполним параметры
	ПеремОбъектДокумента = ДанныеФормыВЗначение(Параметры.ОбъектДок,Тип("ДокументОбъект.ПроведениеСоревнования")); 
	ЗначениеВРеквизитФормы(ПеремОбъектДокумента,"СсылкаНаСоревнование");
	НомерТура			 = Параметры.НомерТура;
	РежимТура			 = Параметры.РежимТура;
	КолПартий			 = Параметры.КолПартий;
	ВидСоревнований = Параметры.ВидСоревнований;
	
	ЖеребьевкаКоманд = Параметры.ЖеребьевкаКоманд;
	КоличествоПобедВКоманднойИгре = ЖеребьевкаКоманд.КоличествоПобед;
	
	ТЧУчастников = СсылкаНаСоревнование.КомандыПоЖеребьевке.Выгрузить();
	
	АдресТаблицаУчастников = ПоместитьВоВременноеХранилище(ТЧУчастников,ЭтотОбъект.УникальныйИдентификатор);
	АдресКопииТаблицыГрупп = ПоместитьВоВременноеХранилище(ТаблицаГруппы.Выгрузить(),ЭтотОбъект.УникальныйИдентификатор);
	
	//получим какие группы завели
	ВсегоКолГрупп = Документы.ПроведениеСоревнования.ОпределитьКоличествоГрупп(ТЧУчастников,НомерТура,РежимТура);
	УО = ЭтотОбъект.УсловноеОформление.Элементы;
	Для Гр = 1 По ВсегоКолГрупп Цикл
		СписокГрупп.Добавить(Гр,"Группа №"+Гр);
		СтрокиГруппы = ТЧУчастников.Скопировать(Новый Структура("НомерГруппы,НомерТура,РежимТура",Гр,НомерТура,РежимТура));
		К = 1;
		Для Каждого ТекСтрока Из СтрокиГруппы Цикл
			//теперь добавим условное оформление
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.СветлоСерый);
			ЭлементУсловие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаГруппы.КолонкаИгры"+К);
			ЭлементУсловие.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловие.ПравоеЗначение= "Х";//для черных квадратиков
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаГруппыКолонкаИгры"+К);
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаГруппыСписокОчков"+К);
			//для нуля скидывание значения
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.Белый);
			ЭлементУсловие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаГруппы.КолонкаИгры"+К);
			ЭлементУсловие.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловие.ПравоеЗначение= "0";//
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаГруппыКолонкаИгры"+К);
			//оформление для Проигравший
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",Новый Цвет(250,198,192));
			ЭлементУсловие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаГруппы.КолонкаИгры"+К);
			ЭлементУсловие.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловие.ПравоеЗначение= "1";//
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаГруппыКолонкаИгры"+К);
			//оформление для 2 Победитель 
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",Новый Цвет(219,251,198));
			ЭлементУсловие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаГруппы.КолонкаИгры"+К);
			ЭлементУсловие.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловие.ПравоеЗначение= "2";//
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаГруппыКолонкаИгры"+К);
			//Выделение колонки
			ЭлементУО = УО.Добавить();
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт",Новый Шрифт(,,Истина));
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",Новый Цвет(0,0,255));
			//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт",Новый Шрифт(,12,Истина));
			ЭлементУсловие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаГруппы.ВыделениеКолонки"+К);
			ЭлементУсловие.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловие.ПравоеЗначение= Истина;//
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаГруппыКолонкаИгры"+К);
			//----------
			К = К + 1;
		КонецЦикла;
	КонецЦикла;
	
	ЭтотОбъект.Заголовок = СсылкаНаСоревнование.НазваниеСоревнования + " "+Параметры.Коммент;
	                           
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &Внеш КАК Внеш";
	Запрос.УстановитьПараметр("Внеш",СсылкаНаСоревнование.ОбщаяТаблицаДанныхПоКомандам.Выгрузить());
	Запрос.Выполнить();
	Текст = "ВЫБРАТЬ
	        |	*
	        |ИЗ
	        |	ТЗ КАК ТЗ
	        |ГДЕ
	        |	ТЗ.НомерТура = &НомТура
	        |	И ТЗ.РежимТура = &РежимТура";
	Запрос.УстановитьПараметр("НомТура",НомерТура);
	Запрос.УстановитьПараметр("РежимТура",РежимТура);
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Результат,"ВсяТаблицаОбщихДанных");
	АдресОбщейТаблицыДанных = ПоместитьВоВременноеХранилище(Результат,ЭтотОбъект.УникальныйИдентификатор);
	
	//продумать если 2 групповой, 3 групповой, нужен только 3
	Для Каждого ТекСтрока Из СсылкаНаСоревнование.ХодСоревнованияКоманды Цикл
		Если ТекСтрока.РежимТура = Перечисления.РежимыТуровСоревнования.Групповой 
			И ТекСтрока.НомерСтроки <> НомерТура Тогда
			ЗаголовокВСписке = ""+ТекСтрока.НомерСтроки+" "+НРег(ТекСтрока.Комментарий);
			СписокГрупповыхЭтапов.Добавить(ТекСтрока.НомерСтроки,ЗаголовокВСписке);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокГрупповыхЭтапов.Количество() >= 1 Тогда
		//Элементы.СУчетомИгр.Видимость = Истина;
	КонецЕсли;
	СУчетомИгр = Ложь;
	ПереоткрытьФорму = Ложь;
	//устанавливаем видимость партиям
	Для Н = 1  По КолПартий Цикл
		Элементы["ТаблицаПартийИгра"+Н].Видимость = Истина;
	КонецЦикла; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоКоманде(ДанныеДляПолучения)
	
	ТЧДока = ПолучитьИзВременногоХранилища(ДанныеДляПолучения.АдресОбщейТаблицыДанных);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВсяТаблица ИЗ &Внеш КАК Внеш";
	Запрос.УстановитьПараметр("Внеш",ТЧДока);
	Запрос.Выполнить();
	Запрос.УстановитьПараметр("НомГруппы",Число(ДанныеДляПолучения.НомГруппы));
    Запрос.УстановитьПараметр("КоличествоПобедВКоманднойИгре",ДанныеДляПолучения.КоличествоПобедВКоманднойИгре);
	Ном = 1;
	
	АдресКопияТаблицы = ПолучитьИзВременногоХранилища(ДанныеДляПолучения.АдресКопииТаблицыГрупп);
	ТаблицаГруппы = АдресКопияТаблицы.СкопироватьКолонки();
	
	ТЧУчастников = ПолучитьИзВременногоХранилища(ДанныеДляПолучения.АдресТаблицаУчастников);
	ИсходныеСтроки = ТЧУчастников.Скопировать(Новый Структура("НомерГруппы,НомерТура,РежимТура",ДанныеДляПолучения.НомГруппы,ДанныеДляПолучения.НомерТура,ДанныеДляПолучения.РежимТура));
	
	//а теперь все остальные игры
	Для Каждого ТекСтрока Из ИсходныеСтроки Цикл
		НовСтрока = ТаблицаГруппы.Добавить();
		НовСтрока.НомерУчастника = Ном;
		НовСтрока.Участник = ТекСтрока.НазваниеКоманды;
		НовСтрока.РейтингУчастника = ТекСтрока.ТекущийРейтинг;
		НовСтрока["КолонкаИгры"+Ном] = "Х";// за место "Х" ячейка будет закрашена
		Ном = Ном + 1;
	КонецЦикла;		 
	Ном = 1;
	//а теперь все остальные игры
	Для Каждого ТекСтрока Из ИсходныеСтроки Цикл
		//НовСтрока = ТаблицаГруппы.Добавить();
		//НовСтрока.НомерУчастника = Ном;
		//НовСтрока.Участник = ТекСтрока.НазваниеКоманды;
		//НовСтрока.РейтингУчастника = ТекСтрока.ТекущийРейтинг;
		//НовСтрока["КолонкаИгры"+Ном] = "Х";// за место "Х" ячейка будет закрашена
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Участник1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Участник2,
		|	СУММА(ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ОчкиВыигравшего) КАК ОчкиВыигравшего,
		|	СУММА(ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ОчкиПроигравшего) КАК ОчкиПроигравшего,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеВ,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеП,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка2
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	ВсяТаблица КАК ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам
		|ГДЕ
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.НомерТура = &НомерТура
		|	И ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.НомерГруппы = &НомГруппы
		|	И (ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда1 = &Участник
		|			ИЛИ ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда2 = &Участник)
		|	И ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка1 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
		|	И ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка2 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Участник1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Участник2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеВ,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеП,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ОчкиВыигравшего,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ОчкиПроигравшего,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеВ,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеП,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.НомерСета
		|ПОМЕСТИТЬ втТаблицаПоПарам
		|ИЗ
		|	ВсяТаблица КАК ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам
		|ГДЕ
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.НомерТура = &НомерТура
		|	И ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.НомерГруппы = &НомГруппы
		|	И (ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда1 = &Участник
		|			ИЛИ ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда2 = &Участник)
		|	И ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка1 = ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
		|	И ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка2 = ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Команда2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ОчкиВыигравшего,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ОчкиПроигравшего,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеВ,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.ТехническоеП,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка1,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.Расстановка2,
		|	ПроведениеСоревнованияОбщаяТаблицаДанныхПоКомандам.НомерСета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаПоПарам.Команда1,
		|	втТаблицаПоПарам.Команда2,
		|	СУММА(втТаблицаПоПарам.ОчкиВыигравшего) КАК ОчкиВыигравшего,
		|	СУММА(втТаблицаПоПарам.ОчкиПроигравшего) КАК ОчкиПроигравшего,
		|	втТаблицаПоПарам.ТехническоеВ,
		|	втТаблицаПоПарам.ТехническоеП
		|ПОМЕСТИТЬ втИтоговаяПоПарам
		|ИЗ
		|	втТаблицаПоПарам КАК втТаблицаПоПарам
		|
		|СГРУППИРОВАТЬ ПО
		|	втТаблицаПоПарам.Команда1,
		|	втТаблицаПоПарам.Команда2,
		|	втТаблицаПоПарам.ТехническоеВ,
		|	втТаблицаПоПарам.ТехническоеП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.Команда1,
		|	втТаблица.Команда2,
		|	втТаблица.ОчкиВыигравшего,
		|	ВЫБОР
		|		КОГДА втТаблица.ОчкиВыигравшего > втТаблица.ОчкиПроигравшего
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Итог1,
		|	втТаблица.ОчкиПроигравшего,
		|	ВЫБОР
		|		КОГДА втТаблица.ОчкиПроигравшего > втТаблица.ОчкиВыигравшего
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Итог2,
		|	втТаблица.ТехническоеВ,
		|	втТаблица.ТехническоеП
		|ПОМЕСТИТЬ втИтоговая
		|ИЗ
		|	втТаблица КАК втТаблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втИтоговаяПоПарам.Команда1,
		|	втИтоговаяПоПарам.Команда2,
		|	втИтоговаяПоПарам.ОчкиВыигравшего,
		|	ВЫБОР
		|		КОГДА втИтоговаяПоПарам.ОчкиВыигравшего > втИтоговаяПоПарам.ОчкиПроигравшего
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	втИтоговаяПоПарам.ОчкиПроигравшего,
		|	ВЫБОР
		|		КОГДА втИтоговаяПоПарам.ОчкиПроигравшего > втИтоговаяПоПарам.ОчкиВыигравшего
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	втИтоговаяПоПарам.ТехническоеВ,
		|	втИтоговаяПоПарам.ТехническоеП
		|ИЗ
		|	втИтоговаяПоПарам КАК втИтоговаяПоПарам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтоговая.Команда1,
		|	втИтоговая.Команда2,
		|	СУММА(втИтоговая.Итог1) КАК Итог1,
		|	СУММА(втИтоговая.Итог2) КАК Итог2,
		|	СУММА(втИтоговая.ОчкиВыигравшего) КАК ОчкиВыигравшего,
		|	СУММА(втИтоговая.ОчкиПроигравшего) КАК ОчкиПроигравшего
		|ПОМЕСТИТЬ втПоследняяИтоговая
		|ИЗ
		|	втИтоговая КАК втИтоговая
		|
		|СГРУППИРОВАТЬ ПО
		|	втИтоговая.Команда1,
		|	втИтоговая.Команда2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПоследняяИтоговая.Команда1,
		|	втПоследняяИтоговая.Команда2,
		|	втПоследняяИтоговая.Итог1,
		|	втПоследняяИтоговая.Итог2
		|ИЗ
		|	втПоследняяИтоговая КАК втПоследняяИтоговая
		|ГДЕ
		|	(втПоследняяИтоговая.Итог1 = &КоличествоПобедВКоманднойИгре
		|			ИЛИ втПоследняяИтоговая.Итог2 = &КоличествоПобедВКоманднойИгре)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаПоПарам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втИтоговаяПоПарам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втИтоговая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втПоследняяИтоговая";
		Запрос.УстановитьПараметр("Участник",ТекСтрока.НазваниеКоманды);
		Запрос.УстановитьПараметр("НомерТура",ДанныеДляПолучения.НомерТура);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда //есть данные по команде
			Для каждого ТекСтрокаРезультата Из Результат Цикл
				СтрокаКоманда1 = ТаблицаГруппы.Найти(ТекСтрокаРезультата.Команда1);
				СтрокаКоманда2 = ТаблицаГруппы.Найти(ТекСтрокаРезультата.Команда2);
				Если ТекСтрокаРезультата.Итог1 > ТекСтрокаРезультата.Итог2 Тогда
					НомКолонки   = ТаблицаГруппы.Индекс(СтрокаКоманда2)+1;
					СтрокаКоманда1["КолонкаИгры"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = "2";
					СтрокаКоманда1["СписокОчков"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = ""+ТекСтрокаРезультата.Итог1+" : "+ТекСтрокаРезультата.Итог2;
					
					НомКолонки   = ТаблицаГруппы.Индекс(СтрокаКоманда1)+1;
					СтрокаКоманда2["КолонкаИгры"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = "1";
					СтрокаКоманда2["СписокОчков"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = ""+ТекСтрокаРезультата.Итог2+" : "+ТекСтрокаРезультата.Итог1;
				Иначе 
					НомКолонки   = ТаблицаГруппы.Индекс(СтрокаКоманда1)+1;
					СтрокаКоманда2["КолонкаИгры"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = "2";
					СтрокаКоманда2["СписокОчков"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = ""+ТекСтрокаРезультата.Итог2+" : "+ТекСтрокаРезультата.Итог1;
					
					НомКолонки   = ТаблицаГруппы.Индекс(СтрокаКоманда2)+1;
					СтрокаКоманда1["КолонкаИгры"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = "1";
					СтрокаКоманда1["СписокОчков"+СтрЗаменить(НомКолонки,Символы.НПП,"")] = ""+ТекСтрокаРезультата.Итог1+" : "+ТекСтрокаРезультата.Итог2;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		Ном = Ном + 1;
	КонецЦикла;
	
	//1. пересчитываем итоговые очки
	КолКолонок = ТаблицаГруппы.Количество();
	Для Каждого ТекСтрока Из ТаблицаГруппы Цикл
		ВсегоОчков = 0;
		Для Кол = 1 По КолКолонок Цикл
			ЗначениеКолонки = ТекСтрока["КолонкаИгры"+СтрЗаменить(Кол,Символы.НПП,"")];
			Если ЗначениеКолонки = "Х" Или ЗначениеКолонки = "" Тогда
			Иначе
				ВсегоОчков = ВсегоОчков + Число(ЗначениеКолонки);
			КонецЕсли;
		КонецЦикла;
		//устанавливаем количество
		ТекСтрока.Очки = ВсегоОчков;
	КонецЦикла;
	
	Н =ДанныеДляПолучения.НомерТура;
	
	ДанныеПоМестамУчастников = Новый ТаблицаЗначений;
	ДанныеПоМестамУчастников.Колонки.Добавить("РеквизитУчастник"+Н,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
	ДанныеПоМестамУчастников.Колонки.Добавить("РеквизитОчки"+Н,Новый ОписаниеТипов("Число"));
	ДанныеПоМестамУчастников.Колонки.Добавить("РеквизитМесто"+Н,Новый ОписаниеТипов("Число"));
	ДанныеПоМестамУчастников.Колонки.Добавить("Соотношение"+Н,Новый ОписаниеТипов("Строка"));
	Для каждого ТекСтр Из ТаблицаГруппы Цикл
		НовСтрока = ДанныеПоМестамУчастников.Добавить();
		НовСтрока["РеквизитУчастник"+Н] 	= ТекСтр.Участник;
		НовСтрока["РеквизитОчки"+Н] 			= ТекСтр.Очки;
		НовСтрока["РеквизитМесто"+Н] 		= 0;
		НовСтрока["Соотношение"+Н] 			= "";
	КонецЦикла; 
	
	Документы.ПроведениеСоревнования.РасчетМестНаСервереКоманды(ДанныеПоМестамУчастников,
		ТЧДока,Н,ДанныеДляПолучения.НомГруппы);
	
	//теперь выведем в таблицу
	Для каждого СтрТаблицы Из ДанныеПоМестамУчастников Цикл
		Искомая = ТаблицаГруппы.НайтиСтроки(Новый Структура("Участник",СтрТаблицы["РеквизитУчастник"+Н]));
		Если Искомая.Количество() > 0 Тогда
			Искомая[0].Место		 =  СтрТаблицы["РеквизитМесто"+Н];
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СерверныеСервер.ТаблицаЗначенийВМассив(ТаблицаГруппы);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	глЗачеркнутыйШрифт = Новый Шрифт("Arial",11,,,,Истина);
	мЗакрытиеФормы = Истина;
	Элементы.ТаблицаПартийОбщийРезультат1.МаксимальноеЗначение = ОпределитьКолПартий();
	Элементы.ТаблицаПартийОбщийРезультат2.МаксимальноеЗначение = ОпределитьКолПартий();
	Если СписокГрупп.Количество() = 1 Тогда
		Элементы.СписокГрупп.Видимость = Ложь;
		ЗаполнитьТаблицуПоНомеруГруппы(1);
	КонецЕсли; 
КонецПроцедуры

//ПРОЦЕДУРЫ И ФУНКЦИИ ОСНОВНОЙ ТАБЛИЦЫ ГРУПП
//

&НаСервереБезКонтекста
Функция ЗаполнениеТабличкиПартий(Данные)
	
	//НаименованиеКоманда1 	= Данные.Выигравший;
	//НаименованиеКоманда2 	= Данные.Проигравший;
	ТаблицаПартий = СформироватьТаблицуПартийТЗ();
	
	ОтборКоманд = Новый Структура;
	ОтборКоманд.Вставить("НомерГруппы",Данные.НомГруппы);
	ОтборКоманд.Вставить("НомерТура",Данные.НомерТура);
	//ОтборКоманд.Вставить("Команда1",Данные.Выигравший);
	//ОтборКоманд.Вставить("Команда2",Данные.Проигравший);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ втТЗ ИЗ &Внеш КАК Внеш";
	Запрос.УстановитьПараметр("Команда1",Данные.Выигравший);
	Запрос.УстановитьПараметр("Команда2",Данные.Проигравший);
	ВсяТаблицаОбщихДанных = ПолучитьИзВременногоХранилища(Данные.АдресОбщейТаблицыДанных);
	Запрос.УстановитьПараметр("Внеш",ВсяТаблицаОбщихДанных.Скопировать(ОтборКоманд));
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	втТЗ.Команда1,
	|	втТЗ.Расстановка1,
	|	втТЗ.Участник1,
	|	втТЗ.Команда2,
	|	втТЗ.Участник2,
	|	втТЗ.Расстановка2,
	|	втТЗ.ТехническоеВ,
	|	втТЗ.ТехническоеП
	|ПОМЕСТИТЬ втДанныеПоИграм
	|ИЗ
	|	втТЗ КАК втТЗ
	|ГДЕ
	|	втТЗ.Команда1 = &Команда1
	|	И втТЗ.Команда2 = &Команда2
	|
	|СГРУППИРОВАТЬ ПО
	|	втТЗ.Команда1,
	|	втТЗ.Команда2,
	|	втТЗ.Участник1,
	|	втТЗ.Участник2,
	|	втТЗ.Расстановка1,
	|	втТЗ.Расстановка2,
	|	втТЗ.ТехническоеВ,
	|	втТЗ.ТехническоеП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТЗ.Команда1,
	|	втТЗ.Расстановка1,
	|	втТЗ.Участник1,
	|	втТЗ.Команда2,
	|	втТЗ.Участник2,
	|	втТЗ.Расстановка2,
	|	втТЗ.ТехническоеВ,
	|	втТЗ.ТехническоеП
	|ИЗ
	|	втТЗ КАК втТЗ
	|ГДЕ
	|	втТЗ.Команда1 = &Команда2
	|	И втТЗ.Команда2 = &Команда1
	|
	|СГРУППИРОВАТЬ ПО
	|	втТЗ.Команда1,
	|	втТЗ.Команда2,
	|	втТЗ.Участник1,
	|	втТЗ.Участник2,
	|	втТЗ.Расстановка1,
	|	втТЗ.Расстановка2,
	|	втТЗ.ТехническоеВ,
	|	втТЗ.ТехническоеП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖеребьевкаКомандПорядокВстреч.НомерСтроки КАК НомерСтроки,
	|	ЖеребьевкаКомандПорядокВстреч.ВариантABC КАК Расстановка1,
	|	ЖеребьевкаКомандПорядокВстреч.ВариантXYZ КАК Расстановка2
	|ПОМЕСТИТЬ ДанныеПоПарам
	|ИЗ
	|	Справочник.ЖеребьевкаКоманд.ПорядокВстреч КАК ЖеребьевкаКомандПорядокВстреч
	|ГДЕ
	|	ЖеребьевкаКомандПорядокВстреч.Ссылка = &Ссылка
	|	И ЖеребьевкаКомандПорядокВстреч.ВариантABC = ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
	|	И ЖеребьевкаКомандПорядокВстреч.ВариантXYZ = ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖеребьевкаКомандПорядокВстреч.ВариантXYZ,
	|	ЖеребьевкаКомандПорядокВстреч.ВариантABC,
	|	ЖеребьевкаКомандПорядокВстреч.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖеребьевкаКомандПорядокВстреч.НомерСтроки КАК НомерСтроки,
	|	втДанныеПоИграм.Команда1,
	|	ЖеребьевкаКомандПорядокВстреч.ВариантABC КАК Расстановка1,
	|	втДанныеПоИграм.Участник1 КАК Участник1,
	|	втДанныеПоИграм.Команда2,
	|	ЖеребьевкаКомандПорядокВстреч.ВариантXYZ КАК Расстановка2,
	|	втДанныеПоИграм.Участник2 КАК Участник2,
	|	втДанныеПоИграм.ТехническоеВ КАК Техническое1,
	|	втДанныеПоИграм.ТехническоеП КАК Техническое2
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	Справочник.ЖеребьевкаКоманд.ПорядокВстреч КАК ЖеребьевкаКомандПорядокВстреч
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеПоИграм КАК втДанныеПоИграм
	|		ПО ЖеребьевкаКомандПорядокВстреч.ВариантABC = втДанныеПоИграм.Расстановка1
	|			И ЖеребьевкаКомандПорядокВстреч.ВариантXYZ = втДанныеПоИграм.Расстановка2
	|ГДЕ
	|	ЖеребьевкаКомандПорядокВстреч.Ссылка = &Ссылка
	|	И ЖеребьевкаКомандПорядокВстреч.ВариантABC <> ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
	|	И ЖеребьевкаКомандПорядокВстреч.ВариантXYZ <> ЗНАЧЕНИЕ(Перечисление.ВариантыРасстановки.Пара)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖеребьевкаКомандПорядокВстреч.ВариантABC,
	|	ЖеребьевкаКомандПорядокВстреч.ВариантXYZ,
	|	ЖеребьевкаКомандПорядокВстреч.НомерСтроки,
	|	втДанныеПоИграм.Команда1,
	|	втДанныеПоИграм.Участник1,
	|	втДанныеПоИграм.Команда2,
	|	втДанныеПоИграм.Участник2,
	|	втДанныеПоИграм.ТехническоеВ,
	|	втДанныеПоИграм.ТехническоеП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втИтоговая.Команда1) КАК Команда1,
	|	МАКСИМУМ(втИтоговая.Команда2) КАК Команда2
	|ПОМЕСТИТЬ втНазваниеКоманд
	|ИЗ
	|	втИтоговая КАК втИтоговая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втИтоговая.НомерСтроки КАК НомерСтроки,
	|	втИтоговая.Команда1,
	|	втИтоговая.Расстановка1 КАК Расстановка1,
	|	втИтоговая.Участник1 КАК Участник1,
	|	втИтоговая.Команда2,
	|	втИтоговая.Расстановка2 КАК Расстановка2,
	|	втИтоговая.Участник2 КАК Участник2,
	|	втИтоговая.Техническое1 КАК Техническое1,
	|	втИтоговая.Техническое2 КАК Техническое2
	|ИЗ
	|	втИтоговая КАК втИтоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка",Данные.ЖеребьевкаКоманд);
	Результат = Запрос.Выполнить().Выгрузить();
		
	Для каждого ТекСтр Из Результат Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПартий.Добавить(),ТекСтр);
	КонецЦикла; 
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ДанныеПоПарам КАК ДанныеПоПарам";
	ДанныеПоПарам = Запрос.Выполнить().Выгрузить();
		
	Если ДанныеПоПарам.Количество() > 0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Расстановка1",ДанныеПоПарам[0].Расстановка1);
		Отбор.Вставить("Расстановка2",ДанныеПоПарам[0].Расстановка2);
		Отбор.Вставить("НомерГруппы",Данные.НомГруппы);
		Отбор.Вставить("НомерТура",Данные.НомерТура);
		Отбор.Вставить("Команда1",Данные.Выигравший);
		Отбор.Вставить("Команда2",Данные.Проигравший);
		втТаблицаПар = ВсяТаблицаОбщихДанных.Скопировать(Отбор,"Участник1,Участник2");
		Если втТаблицаПар.Количество() = 0 Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Расстановка1",ДанныеПоПарам[0].Расстановка1);
			Отбор.Вставить("Расстановка2",ДанныеПоПарам[0].Расстановка2);
			Отбор.Вставить("НомерГруппы",Данные.НомГруппы);
			Отбор.Вставить("НомерТура",Данные.НомерТура);
			Отбор.Вставить("Команда1",Данные.Проигравший);
			Отбор.Вставить("Команда2",Данные.Выигравший);
			втТаблицаПар = ВсяТаблицаОбщихДанных.Скопировать(Отбор,"Участник1,Участник2");
		КонецЕсли; 
		втТаблицаПар.Свернуть("Участник1,Участник2");
		ПараABC = Новый СписокЗначений;	
		ПараXYZ = Новый СписокЗначений;
		Для каждого ТекСтрПары Из втТаблицаПар Цикл
			Если ЗначениеЗаполнено(ТекСтрПары.Участник1) Тогда
				ПараABC.Добавить(ТекСтрПары.Участник1);			
			КонецЕсли; 
			Если ЗначениеЗаполнено(ТекСтрПары.Участник2) Тогда
				ПараXYZ.Добавить(ТекСтрПары.Участник2);
			КонецЕсли;
		КонецЦикла; 
		НовСтрока = ТаблицаПартий.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,ДанныеПоПарам[0]);
		НовСтрока.Участник1 = ПараABC;
		НовСтрока.Участник2 = ПараXYZ;
	КонецЕсли; 
	//а теперь загрузим очки
	Для каждого ТекСтр Из ТаблицаПартий Цикл
		Отбор = Новый Структура;            
		Отбор.Вставить("Расстановка1",ТекСтр.Расстановка1);
		Отбор.Вставить("Расстановка2",ТекСтр.Расстановка2);
		Отбор.Вставить("НомерГруппы",Данные.НомГруппы);
		Отбор.Вставить("НомерТура",Данные.НомерТура);
		Отбор.Вставить("Команда1",Данные.Выигравший);
		Отбор.Вставить("Команда2",Данные.Проигравший);
		втТаблицаОчков = ВсяТаблицаОбщихДанных.Скопировать(Отбор,"КолШаров,ОчкиВыигравшего,ОчкиПроигравшего,НомерСета,ТехническоеВ,ТехническоеП");
		мКоманда1ДляПары = Данные.Выигравший;
		мКоманда2ДляПары = Данные.Проигравший;
		Если втТаблицаОчков.Количество() = 0 Тогда //попробуем по другому
			Отбор = Новый Структура;            
			Отбор.Вставить("Расстановка1",ТекСтр.Расстановка1);
			Отбор.Вставить("Расстановка2",ТекСтр.Расстановка2);
			Отбор.Вставить("НомерГруппы",Данные.НомГруппы);
			Отбор.Вставить("НомерТура",Данные.НомерТура);
			Отбор.Вставить("Команда2",Данные.Выигравший);
			Отбор.Вставить("Команда1",Данные.Проигравший);
			втТаблицаОчков = ВсяТаблицаОбщихДанных.Скопировать(Отбор,"КолШаров,ОчкиВыигравшего,ОчкиПроигравшего,НомерСета,ТехническоеВ,ТехническоеП");
			мКоманда1ДляПары = Данные.Проигравший;
			мКоманда2ДляПары = Данные.Выигравший;
		КонецЕсли; 
		втТаблицаОчков.Свернуть("КолШаров,ОчкиВыигравшего,ОчкиПроигравшего,НомерСета,ТехническоеВ,ТехническоеП");
		втИтог1 = 0;
		втИтог2 = 0;
		Если втТаблицаОчков.Количество() = 1 Тогда //ввод по партиям
			втИтог1 = втТаблицаОчков[0].ОчкиВыигравшего;
			втИтог2 = втТаблицаОчков[0].ОчкиПроигравшего;
			Если ТекСтр.Расстановка1 = Перечисления.ВариантыРасстановки.Пара
				Или ТекСтр.Расстановка2 = Перечисления.ВариантыРасстановки.Пара Тогда
				ТекСтр.Команда1			= мКоманда1ДляПары;
				ТекСтр.Команда2			= мКоманда2ДляПары;
				ТекСтр.Техническое1	= втТаблицаОчков[0].ТехническоеВ;
				ТекСтр.Техническое2	= втТаблицаОчков[0].ТехническоеП
			КонецЕсли; 
		Иначе
			Для Каждого ТекСтрокаТаблицы Из втТаблицаОчков Цикл
				СтрМассива = ТекСтрокаТаблицы;
				Если СтрМассива.ОчкиВыигравшего = 0 И СтрМассива.ОчкиПроигравшего = 0 Тогда
					Продолжить;
				КонецЕсли; 
				Если СтрМассива.ОчкиВыигравшего = 1 Тогда //ставим с + 
					ЗначОчка = СтрМассива.КолШаров;
					втИтог1 = втИтог1 + 1;
				Иначе
					втИтог2 = втИтог2 + 1;
					Если СтрМассива.КолШаров = 0 Тогда
						ЗначОчка = "-0";
					Иначе
						ЗначОчка = Строка(СтрМассива.КолШаров);
					КонецЕсли; 
				КонецЕсли;
				ТекСтр["Игра"+СтрМассива.НомерСета] = ЗначОчка;
			КонецЦикла;
		КонецЕсли; 
		Если втИтог1 = 0 И втИтог2 = 0 Тогда
			Продолжить;
		КонецЕсли; 
		ТекСтр.ОбщийРезультат1 = втИтог1;
		ТекСтр.ОбщийРезультат2 = втИтог2;
		Если втИтог1 > втИтог2 Тогда
			ТекСтр.Итог1 = 1;
			ТекСтр.Итог2 = 0;
		Иначе
			ТекСтр.Итог1 = 0;
			ТекСтр.Итог2 = 1;
		КонецЕсли; 
	КонецЦикла; 
	
	ТаблицаПартий.Сортировать("НомерСтроки ВОЗР");
	
	Возврат СерверныеСервер.ТаблицаЗначенийВМассив(ТаблицаПартий);
		
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТаблицуПартийТЗ()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("НомерСтроки");
	Таблица.Колонки.Добавить("Рейтинг");
	Для Н = 1 По 2 Цикл
		Таблица.Колонки.Добавить("Участник"+Н);
		Таблица.Колонки.Добавить("Техническое"+Н);
		Таблица.Колонки.Добавить("Расстановка"+Н);
		Таблица.Колонки.Добавить("Итог"+Н);
		Таблица.Колонки.Добавить("ОбщийРезультат"+Н);
		Таблица.Колонки.Добавить("Команда"+Н);
	КонецЦикла;
	Для П = 1 По 7 Цикл
		Таблица.Колонки.Добавить("Игра"+П);		
	КонецЦикла; 

	Возврат Таблица;
	
КонецФункции
  
&НаКлиенте
Функция ОпределитьКолПартий()
	
	Если КолПартий = 3 Тогда
		ИтогСтроки = 2;
	ИначеЕсли КолПартий = 5 Тогда
		ИтогСтроки = 3;
	ИначеЕсли КолПартий = 7 Тогда
		ИтогСтроки = 4;
	КонецЕсли;
	Возврат ИтогСтроки;
	
КонецФункции

&НаСервере
Процедура ОбновитьДопИнформацию(НомГруппы)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ОсновнаяТЗ Из &Внеш КАК Внеш";
	Запрос.УстановитьПараметр("Внеш",ВсяТаблицаОбщихДанных.Выгрузить());
	Запрос.Выполнить();
	
	Текст = "ВЫБРАТЬ
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерТура,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.РежимТура,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерГруппы КАК НомерГруппы,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерГруппы КАК НомерГруппы1,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Выигравший,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Проигравший
	|ПОМЕСТИТЬ втТЗ
	|ИЗ
	|	ОсновнаяТЗ КАК ПроведениеСоревнованияОбщаяТаблицаДанных
	|ГДЕ
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерТура = &НомерТура
	|	И ПроведениеСоревнованияОбщаяТаблицаДанных.НомерГруппы = &НомерГруппы
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Проигравший,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Выигравший,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.РежимТура,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерТура,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерГруппы,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерГруппы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЗ.НомерТура,
	|	втТЗ.РежимТура,
	|	втТЗ.НомерГруппы,
	|	КОЛИЧЕСТВО(втТЗ.НомерГруппы1) КАК ВсегоСыграно
	|ИЗ
	|	втТЗ КАК втТЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	втТЗ.НомерТура,
	|	втТЗ.РежимТура,
	|	втТЗ.НомерГруппы";
	Запрос.УстановитьПараметр("НомерТура",Число(НомерТура));
	Запрос.УстановитьПараметр("НомерГруппы",Число(НомГруппы));
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		ПеремВсегоСыграно = Результат[0].ВсегоСыграно;
	Иначе
		ПеремВсегоСыграно = 0;
	КонецЕсли;	
	
	ТЗУчастников = СсылкаНаСоревнование.КомандыПоЖеребьевке.Выгрузить(Новый Структура("НомерТура,НомерГруппы",НомерТура,Число(НомГруппы)));
	КолИгроков = ТЗУчастников.Количество();
	
	ВсегоИгр = КолИгроков*(КолИгроков-1)/2;	
	Элементы["ВсегоИгр_"+НомГруппы].Заголовок = "Всего игр: "+ВсегоИгр;
	Элементы["Сыграно_"+НомГруппы].Заголовок = "Уже сыграно: "+ПеремВсегоСыграно;
	Элементы["ОсталосьСыграть_"+НомГруппы].Заголовок = "Осталось: "+(ВсегоИгр-ПеремВсегоСыграно);
	
КонецПроцедуры
 

//ПРОЦЕДУРЫ И ФУНКЦИИ ТАБЛИЦЫ ПАРТИЙ ОЧКОВ
//
&НаКлиенте
Процедура ТаблицаПартийПередНачаломИзменения(Элемент, Отказ)
	Если Найти(Элемент.ТекущийЭлемент.Имя,"Итог") > 0 Тогда
		Возврат;	
	КонецЕсли; 
	ТекСтрока = Элемент.ТекущиеДанные;
	Если Число(СуммаИтогов1) = КоличествоПобедВКоманднойИгре
		Или Число(СуммаИтогов2) = КоличествоПобедВКоманднойИгре Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Командная игра уже сыграна!");
	КонецЕсли; 
	Если Найти(Элемент.ТекущийЭлемент.Имя,"ОбщийРезультат") = 0 Тогда
		глСтароеЗначениеКолонки = ТекСтрока[СтрЗаменить(СтрЗаменить(Элемент.ТекущийЭлемент.Имя,"_",""),"ТаблицаПартий","")];		
		//а теперь проверим итоги может уже все проставлено
		мЗначИтога1 = ТекСтрока.ОбщийРезультат1;
		Если мЗначИтога1 = "" Тогда
			Итог1 = 0;
		Иначе
			Итог1 =  Число(мЗначИтога1);
		КонецЕсли;
		мЗначИтога2 = ТекСтрока.ОбщийРезультат2;
		Если мЗначИтога2 = "" Тогда
			Итог2 = 0;
		Иначе
			Итог2 = Число(мЗначИтога2);
		КонецЕсли; 
		мОтказ = Ложь;
		Если КолПартий = 3 Тогда
			Если Итог1 = 2 Или Итог2 = 2 Тогда //уже есть итог
				мОтказ = Истина;
			КонецЕсли;
		ИначеЕсли КолПартий = 5 Тогда
			Если Итог1 = 3 Или Итог2 = 3 Тогда //все данные заполненны
				мОтказ = Истина;
			КонецЕсли;
		ИначеЕсли КолПартий = 7 Тогда
			Если Итог1 = 4 Или Итог2 = 4 Тогда //все данные заполненны
				мОтказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если мОтказ Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийПриИзменении(Элемент)
	
	НомГруппы = ОпределитьНомерГруппыПоЭлементу();
	
	ЭлТаблицаПартий 	= Элементы.ТаблицаПартий;
	ТекСтрока 				= Элементы.ТаблицаПартий.ТекущиеДанные;	
	
	ТекНомерЭлемента = Число(Прав(Элемент.Имя,1));
	СледЭлемент = ТекНомерЭлемента+1;
	Если СледЭлемент <= КолПартий Тогда //продвигаем
		ЭтотОбъект.ТекущийЭлемент = Элементы["ТаблицаПартийИгра"+СледЭлемент];
	КонецЕсли;
	Данные = Новый Структура;
	Данные.Вставить("НомГруппы",НомГруппы);
	ПосчитатьИтогиПартийДляТаблицы(Данные);
	Если ТекСтрока.Итог1 = 1 Или ТекСтрока.Итог2 = 1 Тогда
		//записываем партию по строке
		ЗаписатьПартию(ТекСтрока.ПолучитьИдентификатор(),НомГруппы);
		//активируем след.строку
		ИДТекСтроки = ТаблицаПартий.Индекс(ТекСтрока);
		Если ИДТекСтроки < ТаблицаПартий.Количество() - 1 Тогда
			ЭлТаблицаПартий.ТекущаяСтрока = ТаблицаПартий.Получить(ИДТекСтроки+1).ПолучитьИдентификатор();
			ЭтотОбъект.ТекущийЭлемент = Элементы["ТаблицаПартийИгра1"];
		КонецЕсли;
		Если Число(СуммаИтогов1) = КоличествоПобедВКоманднойИгре
			Или Число(СуммаИтогов2) = КоличествоПобедВКоманднойИгре Тогда
			СписокГруппПриАктивизацииСтроки(Элементы.СписокГрупп);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПартию(ИДСтроки = Неопределено,НомГруппы = 1)
	
	СтрокаДанных = ТаблицаПартий.НайтиПоИдентификатору(ИДСтроки);
	
	ДанныеПоСтроке = РазложитьСтрокуНаДанные(СтрокаДанных,НомГруппы);	
	
	ЭтотОбъект.Модифицированность = Истина;
	ТЧДока = ВсяТаблицаОбщихДанных;
	//попробуем найти эту пару
	Отбор = Новый Структура;                               
	Отбор.Вставить("Расстановка1",ДанныеПоСтроке.Расстановка1);
	Отбор.Вставить("Расстановка2",ДанныеПоСтроке.Расстановка2);
	Отбор.Вставить("НомерТура",НомерТура);
	Отбор.Вставить("НомерГруппы",НомГруппы);
	Отбор.Вставить("Команда1",НаименованиеКоманда1);
	Отбор.Вставить("Команда2",НаименованиеКоманда2);
	ИскомыеСтроки = ТЧДока.НайтиСтроки(Отбор);
	Если ИскомыеСтроки.Количество() > 0 Тогда //строки уже есть перезаполняем
		Для Каждого ТекСтрока Из ИскомыеСтроки Цикл
			ТЧДока.Удалить(ТЧДока.Индекс(ТекСтрока));
		КонецЦикла;
	КонецЕсли;
	СчЗаписанныхПартий = 0;
	Для Н = 1 По КолПартий Цикл
		ЗначПартии= ДанныеПоСтроке["Партия"+Н];
		Если ЗначПартии = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СчЗаписанныхПартий = СчЗаписанныхПартий + 1;
		Если ДанныеПоСтроке.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара")
			И ДанныеПоСтроке.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
			Для П = 0 По 1 Цикл
				НовСтрока = ТЧДока.Добавить();
				НовСтрока.НомерТура = НомерТура;
				НовСтрока.РежимТура = РежимТура;
				НовСтрока.Команда1 = ДанныеПоСтроке.НаименованиеКоманда1;
				НовСтрока.Расстановка1 = ДанныеПоСтроке.Расстановка1;
				НовСтрока.Команда2 = ДанныеПоСтроке.НаименованиеКоманда2;
				НовСтрока.Расстановка2 = ДанныеПоСтроке.Расстановка2;
				НовСтрока.НомерГруппы = НомГруппы;
				НовСтрока.НомерСета = Н;
				НовСтрока.Участник1 = ДанныеПоСтроке.Участник1[П].Значение;
				НовСтрока.Участник2 = ДанныеПоСтроке.Участник2[П].Значение;
				НовСтрока.КолШаров	   = Число(ЗначПартии);
				Если Лев(ЗначПартии,1) = "-" Тогда
					НовСтрока.ОчкиВыигравшего = 0;
					НовСтрока.ОчкиПроигравшего= 1;
				Иначе
					НовСтрока.ОчкиВыигравшего = 1;
					НовСтрока.ОчкиПроигравшего= 0;
				КонецЕсли;
				НовСтрока.ТехническоеВ = ДанныеПоСтроке.Техническое1;
				НовСтрока.ТехническоеП = ДанныеПоСтроке.Техническое2; 
			КонецЦикла; 
		Иначе
			НовСтрока = ТЧДока.Добавить();
			НовСтрока.НомерТура = НомерТура;
			НовСтрока.РежимТура = РежимТура;
			НовСтрока.Команда1 = ДанныеПоСтроке.НаименованиеКоманда1;
			НовСтрока.Расстановка1 = ДанныеПоСтроке.Расстановка1;
			НовСтрока.Команда2 = ДанныеПоСтроке.НаименованиеКоманда2;
			НовСтрока.Расстановка2 = ДанныеПоСтроке.Расстановка2;
			НовСтрока.НомерГруппы = НомГруппы;
			НовСтрока.НомерСета = Н;
			НовСтрока.Участник1 = ДанныеПоСтроке.Участник1;
			НовСтрока.Участник2 = ДанныеПоСтроке.Участник2;
			НовСтрока.КолШаров	   = Число(ЗначПартии);
			Если Лев(ЗначПартии,1) = "-" Тогда
				НовСтрока.ОчкиВыигравшего = 0;
				НовСтрока.ОчкиПроигравшего= 1;
			Иначе
				НовСтрока.ОчкиВыигравшего = 1;
				НовСтрока.ОчкиПроигравшего= 0;
			КонецЕсли; 
			НовСтрока.ТехническоеВ = ДанныеПоСтроке.Техническое1;
			НовСтрока.ТехническоеП = ДанныеПоСтроке.Техническое2; 
		КонецЕсли; 
	КонецЦикла;
	Если СчЗаписанныхПартий = 0 Тогда //ввод по партиям или техническое
		Если ДанныеПоСтроке.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара")
			И ДанныеПоСтроке.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
			Для П = 0 По 1 Цикл
				НовСтрока = ТЧДока.Добавить();
				НовСтрока.НомерТура = НомерТура;
				НовСтрока.РежимТура = РежимТура;
				НовСтрока.Команда1 = ДанныеПоСтроке.НаименованиеКоманда1;
				НовСтрока.Расстановка1 = ДанныеПоСтроке.Расстановка1;
				НовСтрока.Команда2 = ДанныеПоСтроке.НаименованиеКоманда2;
				НовСтрока.Расстановка2 = ДанныеПоСтроке.Расстановка2;
				НовСтрока.НомерГруппы = НомГруппы;
				НовСтрока.НомерСета = 1;
				НовСтрока.Участник1 = ДанныеПоСтроке.Участник1[П].Значение;
				НовСтрока.Участник2 = ДанныеПоСтроке.Участник2[П].Значение;
				НовСтрока.ОчкиВыигравшего = ДанныеПоСтроке.Итог1;
				НовСтрока.ОчкиПроигравшего= ДанныеПоСтроке.Итог2;
				НовСтрока.ТехническоеВ = ДанныеПоСтроке.Техническое1;
				НовСтрока.ТехническоеП = ДанныеПоСтроке.Техническое2; 
			КонецЦикла; 
		Иначе
			НовСтрока = ТЧДока.Добавить();
			НовСтрока.НомерТура = НомерТура;
			НовСтрока.РежимТура = РежимТура;
			НовСтрока.Команда1 = ДанныеПоСтроке.НаименованиеКоманда1;
			НовСтрока.Расстановка1 = ДанныеПоСтроке.Расстановка1;
			НовСтрока.Команда2 = ДанныеПоСтроке.НаименованиеКоманда2;
			НовСтрока.Расстановка2 = ДанныеПоСтроке.Расстановка2;
			НовСтрока.НомерГруппы = НомГруппы;
			НовСтрока.НомерСета = 1;
			НовСтрока.Участник1 = ДанныеПоСтроке.Участник1;
			НовСтрока.Участник2 = ДанныеПоСтроке.Участник2;
			НовСтрока.ОчкиВыигравшего = ДанныеПоСтроке.Итог1;
			НовСтрока.ОчкиПроигравшего= ДанныеПоСтроке.Итог2;
			НовСтрока.ТехническоеВ = ДанныеПоСтроке.Техническое1;
			НовСтрока.ТехническоеП = ДанныеПоСтроке.Техническое2; 
		КонецЕсли; 
	КонецЕсли; 
	
	ОбновитьАдресаТаблиц();
	//---
	//обновить сводную таблицу из общей
	//ВыполнитьДействияПослеЗаписиИгры();
	
КонецПроцедуры

&НаКлиенте
Функция РазложитьСтрокуНаДанные(СтрокаТаблицы,НомГруппы)
	
	мИтогПартий1 = 0;
	мИтогПартий2 = 0;
	Данные = Новый Структура;
	СчЗаписанныхПартий = 0;
	Для Н = 1 По КолПартий Цикл
		ЗначСтрокиПартии = СокрЛП(СтрокаТаблицы["Игра"+Н]);
		Если ЗначСтрокиПартии <> "" Тогда
			Если Лев(ЗначСтрокиПартии,1) = "-" Тогда //очко для второй команды
				мИтогПартий2 = мИтогПартий2 + 1;
			Иначе //выиграл первый
				мИтогПартий1 = мИтогПартий1 + 1;
			КонецЕсли; 
			Данные.Вставить("Партия"+Н,ЗначСтрокиПартии);
			СчЗаписанныхПартий = СчЗаписанныхПартий + 1;
		Иначе
			Данные.Вставить("Партия"+Н,Неопределено);
		КонецЕсли;
	КонецЦикла;
	Если СчЗаписанныхПартий = 0 Тогда
		мИтогПартий1 = СтрокаТаблицы.ОбщийРезультат1;
		мИтогПартий2 = СтрокаТаблицы.ОбщийРезультат2;
	КонецЕсли; 
	
	Если мИтогПартий1 > мИтогПартий2 Тогда
		Данные.Вставить("Выигравший",СтрокаТаблицы.Участник1);
		Данные.Вставить("Проигравший",СтрокаТаблицы.Участник2);
		Данные.Вставить("ИтогВыигравшего",мИтогПартий1);
		Данные.Вставить("ИтогПроигравшего",мИтогПартий2);
	Иначе
		Данные.Вставить("Выигравший",СтрокаТаблицы.Участник2);
		Данные.Вставить("Проигравший",СтрокаТаблицы.Участник1);
		Данные.Вставить("ИтогВыигравшего",мИтогПартий2);
		Данные.Вставить("ИтогПроигравшего",мИтогПартий1);
	КонецЕсли; 
	Данные.Вставить("Расстановка1",СтрокаТаблицы.Расстановка1);
	Данные.Вставить("Расстановка2",СтрокаТаблицы.Расстановка2);
	Данные.Вставить("Участник1",СтрокаТаблицы.Участник1);
	Данные.Вставить("Участник2",СтрокаТаблицы.Участник2);
	Данные.Вставить("Итог1",мИтогПартий1);
	Данные.Вставить("Итог2",мИтогПартий2);
	Данные.Вставить("Техническое1",СтрокаТаблицы.Техническое1);
	Данные.Вставить("Техническое2",СтрокаТаблицы.Техническое2);
	Данные.Вставить("НаименованиеКоманда1",НаименованиеКоманда1);
	Данные.Вставить("НаименованиеКоманда2",НаименованиеКоманда2);
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИтоговыеОчки()
	СуммаИтогов1 = ТаблицаПартий.Итог("Итог1");
	СуммаИтогов2 = ТаблицаПартий.Итог("Итог2");
	//ЗаголовокДляТаблицы = "Общий командный счет: "+СуммаИтогов1+ " - " + СуммаИтогов2;
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИтогиПартийДляТаблицы(Данные)
	
	ТекСтрока = Элементы.ТаблицаПартий.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда //рассчитываем все строки
		Для каждого СтрокаПартии Из ТаблицаПартий Цикл
			Если ЗначениеЗаполнено(СтрокаПартии.Участник1) И ЗначениеЗаполнено(СтрокаПартии.Участник2) Тогда
				СтрокаПартии.Итог1 = 0;
				СтрокаПартии.Итог2 = 0;
				РассчитатьСтрокуПартийПоПартиям(СтрокаПартии,Данные.НомГруппы);
			КонецЕсли; 
		КонецЦикла;
	Иначе //рассчитываем переданную строчку
		Если ЗначениеЗаполнено(ТекСтрока.Участник1) И ЗначениеЗаполнено(ТекСтрока.Участник2) Тогда
			ТекСтрока.Итог1 = 0;
			ТекСтрока.Итог2 = 0;
			РассчитатьСтрокуПартийПоПартиям(ТекСтрока,Данные.НомГруппы);
		КонецЕсли; 
	КонецЕсли; 	
	
	ОбновитьИтоговыеОчки();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтрокуПартийПоПартиям(СтрокаПартии,НомГруппы)
	
	мВсегоПартийДляВыигрыша = ОпределитьКолПартий();
	//считаем по этой строке все значения
	мИтогПартий1 = 0;
	мИтогПартий2 = 0;
	ПартияЗакончилась = Ложь;
	Для Партии = 1 По КолПартий Цикл
		//Если СтрокаПартии.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара")
		//	Или СтрокаПартии.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
		//Иначе		
			ЗначСтрокиПартии = СокрЛП(СтрокаПартии["Игра"+Партии]);
			Если ЗначСтрокиПартии <> "" Тогда
				Если Лев(ЗначСтрокиПартии,1) = "-" Тогда //очко для второй команды
					мИтогПартий2 = мИтогПартий2 + 1;
				Иначе //выиграл первый
					мИтогПартий1 = мИтогПартий1 + 1;
				КонецЕсли; 
			КонецЕсли;
		//КонецЕсли;
	КонецЦикла; 
	//определим выигравшего и проигравшего
	Если мИтогПартий1 = мВсегоПартийДляВыигрыша Тогда
		ПартияЗакончилась = Истина;
		ИтогСтроки1 = 1;
		ИтогСтроки2 = 0;
	ИначеЕсли мИтогПартий2 = мВсегоПартийДляВыигрыша Тогда 
		ПартияЗакончилась = Истина;
		ИтогСтроки1 = 0;
		ИтогСтроки2 = 1;
	Иначе
		ПартияЗакончилась = Ложь;
	КонецЕсли;
	СтрокаПартии.ОбщийРезультат1 = мИтогПартий1;
	СтрокаПартии.ОбщийРезультат2 = мИтогПартий2;
	
	Если ПартияЗакончилась Тогда
		//ставим единичку
		СтрокаПартии.Итог1 = ИтогСтроки1;
		СтрокаПартии.Итог2 = ИтогСтроки2;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийОбщийРезультатПриИзменении(Элемент)
	
	ТекСтр = Элементы.ТаблицаПартий.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПартийДляПобеды = ОпределитьКолПартий();
	Если Найти(Элемент.Имя,"Результат1") > 0 Тогда
		ТекЗначение = ТекСтр.ОбщийРезультат1;
		Если ТекЗначение < 0 Тогда
			ТекЗначение = -ТекЗначение;
			Если ТекЗначение = ПартийДляПобеды Тогда
				ПоказатьПредупреждение(Новый ОписаниеОповещения("ТаблицаПартийОбщийРезультатПриИзмененииЗавершение1", ЭтотОбъект, Новый Структура("ТекСтр", ТекСтр)), "Ошибка! Максимальное количество партий "+ПартийДляПобеды);
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		Если ТекЗначение < ПартийДляПобеды Тогда
			ТекСтр.ОбщийРезультат1 = ТекЗначение;
			ТекСтр.ОбщийРезультат2 = ПартийДляПобеды;
		Иначе
			ТекСтр.ОбщийРезультат1 = ТекЗначение;
			ТекСтр.ОбщийРезультат2 = ТекСтр.ОбщийРезультат2;
		КонецЕсли; 
	ИначеЕсли Найти(Элемент.Имя,"Результат2") > 0 Тогда
		ТекЗначение = ТекСтр.ОбщийРезультат2;	
		Если ТекЗначение < 0 Тогда
			ТекЗначение = -ТекЗначение;
			Если ТекЗначение = ПартийДляПобеды Тогда
				ПоказатьПредупреждение(Новый ОписаниеОповещения("ТаблицаПартийОбщийРезультатПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("ТекСтр", ТекСтр)), "Ошибка! Максимальное количество партий "+ПартийДляПобеды);
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		Если ТекЗначение < ПартийДляПобеды Тогда
			ТекСтр.ОбщийРезультат2 = ТекЗначение;
			ТекСтр.ОбщийРезультат1 = ПартийДляПобеды;
		Иначе
			ТекСтр.ОбщийРезультат2 = ТекЗначение;
			ТекСтр.ОбщийРезультат1 = ТекСтр.ОбщийРезультат2;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ТекСтр.ОбщийРезультат1 = ПартийДляПобеды Или ТекСтр.ОбщийРезультат2 = ПартийДляПобеды Тогда
		ЗаписатьПартию(ТекСтр.ПолучитьИдентификатор(),ОпределитьНомерГруппыПоЭлементу());
		Если ТекСтр.ОбщийРезультат1 > ТекСтр.ОбщийРезультат2 Тогда
			ТекСтр.Итог1 = 1;
			ТекСтр.Итог2 = 0;
		Иначе
			ТекСтр.Итог1 = 0;
			ТекСтр.Итог2 = 1;
		КонецЕсли;
		ОбновитьИтоговыеОчки();
		//активируем след.строку
		ИДТекСтроки = ТаблицаПартий.Индекс(ТекСтр);
		Если ИДТекСтроки < ТаблицаПартий.Количество() - 1 Тогда
			Элементы.ТаблицаПартий.ТекущаяСтрока = ТаблицаПартий.Получить(ИДТекСтроки+1).ПолучитьИдентификатор();
			ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаПартийОбщийРезультат1;
		КонецЕсли;
		Если Число(СуммаИтогов1) = КоличествоПобедВКоманднойИгре
			Или Число(СуммаИтогов2) = КоличествоПобедВКоманднойИгре Тогда
			СписокГруппПриАктивизацииСтроки(Элементы.СписокГрупп);
		КонецЕсли; 
	Иначе 
		Если Найти(Элемент.Имя,"Результат1") > 0 Тогда
			ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаПартийОбщийРезультат2;	
		ИначеЕсли Найти(Элемент.Имя,"Результат2") > 0 Тогда
			ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаПартийОбщийРезультат1;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийОбщийРезультатПриИзмененииЗавершение1(ДополнительныеПараметры) Экспорт
	
	ТекСтр = ДополнительныеПараметры.ТекСтр;
	
	
	ТекСтр.ОбщийРезультат1 = 0;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийОбщийРезультатПриИзмененииЗавершение(ДополнительныеПараметры) Экспорт
	
	ТекСтр = ДополнительныеПараметры.ТекСтр;
	
	
	ТекСтр.ОбщийРезультат2 = 0;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийНачалоВыбораУчастника1(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.СписокГрупп.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	НомГруппы = ТекСтрока.Значение;
	
	ТекСтрока = Элементы.ТаблицаПартий.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	мПеремСписок = Новый СписокЗначений;
	Массив = СсылкаНаСоревнование.ТаблицаКоманд.НайтиСтроки(Новый Структура("НазваниеКоманды",НаименованиеКоманда1));
	Если ТекСтрока.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
		Для каждого ТекСтр Из Массив Цикл
			Для каждого ТекСтр1 Из Массив Цикл
				Если ТекСтр.Участник = ТекСтр1.Участник Тогда
					Продолжить;
				КонецЕсли; 
				СуммаРейтинга = ТекСтр.ТекущийРейтинг + ТекСтр1.ТекущийРейтинг;
				ПредставлениеПары = Строка(ТекСтр.Участник)+"-"+Строка(ТекСтр1.Участник)+" ("+СуммаРейтинга+")";
				ПараУчастников = Новый СписокЗначений;
				ПараУчастников.Добавить(ТекСтр.Участник,Строка(ТекСтр.Участник));
				ПараУчастников.Добавить(ТекСтр1.Участник,Строка(ТекСтр1.Участник));
				Если ПроверкаПарыУчастниковВСписке(ПараУчастников,мПеремСписок) Тогда
					мПеремСписок.Добавить(ПараУчастников,ПредставлениеПары,,БиблиотекаКартинок.Пары);				
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	Иначе
		мСписокВыбранных = Новый СписокЗначений;
		Для Каждого СтрПартий Из ТаблицаПартий Цикл
			Если СтрПартий.Расстановка1 <> ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
				мСписокВыбранных.Добавить(СтрПартий.Участник1);
			КонецЕсли; 
		КонецЦикла;
		Для Каждого ТекСтр Из Массив Цикл
			Искомый = мСписокВыбранных.НайтиПоЗначению(ТекСтр.Участник);
			Если Искомый = Неопределено Тогда
				мПеремСписок.Добавить(ТекСтр.Участник,Строка(ТекСтр.Участник)+" ("+ТекСтр.ТекущийРейтинг+")",,БиблиотекаКартинок.Пользователь);
			Иначе
				//мПеремСписок.Добавить(ТекСтр.Участник,Строка(ТекСтр.Участник)+" ("+ТекСтр.ТекущийРейтинг+")",,БиблиотекаКартинок.ПользовательСАутентификацией);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;

	ЭтотОбъект.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ТаблицаПартийНачалоВыбораУчастника1Завершение",
		ЭтотОбъект, Новый Структура("НомГруппы, ТекСтрока", НомГруппы, ТекСтрока)), мПеремСписок, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийНачалоВыбораУчастника1Завершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	НомГруппы = ДополнительныеПараметры.НомГруппы;
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
		
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТекСтрока.Участник1 = ВыбранныйЭлемент.Значение;
		Для каждого ТекСтрПартии Из ТаблицаПартий Цикл
			ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();
			ИДСтрПартии = ТекСтрПартии.ПолучитьИдентификатор();
			Если ИДТекСтроки <> ИДСтрПартии Тогда
				Если ТекСтрПартии.Расстановка1 = ТекСтрока.Расстановка1 Тогда
					ТекСтрПартии.Участник1 = ВыбранныйЭлемент.Значение;
					Прервать;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
		ТаблицаПартийУчастникПриИзменении(НомГруппы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийОчисткаУчастника1(Элемент, СтандартнаяОбработка)
	
	НомГруппы = ОпределитьНомерГруппыПоЭлементу();
	ТекСтрока = Элементы.ТаблицаПартий.ТекущиеДанные;
	
	ЗначУчастника = ТекСтрока.Участник1;
	Для Каждого ТекСтр Из ТаблицаПартий Цикл
		Если ТекСтр.Участник1 = ЗначУчастника Тогда
			ТекСтр.Участник1 = Неопределено;
		КонецЕсли; 
	КонецЦикла; 
	ТаблицаПартийУчастникПриИзменении(НомГруппы);
	
КонецПроцедуры
 
&НаКлиенте
Функция ПроверкаПарыУчастниковВСписке(СписокДляПроверки,СписокВсехПар)
	
	ПарыНет = Истина;
	Для каждого ТекПара Из СписокВсехПар Цикл
		Уч1 = ТекПара.Значение[0].Значение;
		Уч2 = ТекПара.Значение[1].Значение;
		
		Уч1Проверка = СписокДляПроверки[0].Значение;
		Уч2Проверка = СписокДляПроверки[1].Значение;
		
		Если (Уч1 = Уч1Проверка И Уч2 = Уч2Проверка) 
			Или (Уч1 = Уч2Проверка И Уч2 = Уч1Проверка) Тогда
			ПарыНет = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ПарыНет;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПартийНачалоВыбораУчастника2(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.СписокГрупп.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	НомГруппы = ТекСтрока.Значение;

	ТекСтрока = Элементы.ТаблицаПартий.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	мПеремСписок = Новый СписокЗначений;
	Массив = СсылкаНаСоревнование.ТаблицаКоманд.НайтиСтроки(Новый Структура("НазваниеКоманды",НаименованиеКоманда2));
	Если ТекСтрока.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
		Для каждого ТекСтр Из Массив Цикл
			Для каждого ТекСтр1 Из Массив Цикл
				Если ТекСтр.Участник = ТекСтр1.Участник Тогда
					Продолжить;
				КонецЕсли; 
				СуммаРейтинга = ТекСтр.ТекущийРейтинг + ТекСтр1.ТекущийРейтинг;
				ПредставлениеПары = Строка(ТекСтр.Участник)+"-"+Строка(ТекСтр1.Участник)+" ("+СуммаРейтинга+")";
				ПараУчастников = Новый СписокЗначений;
				ПараУчастников.Добавить(ТекСтр.Участник,Строка(ТекСтр.Участник));
				ПараУчастников.Добавить(ТекСтр1.Участник,Строка(ТекСтр1.Участник));
				Если ПроверкаПарыУчастниковВСписке(ПараУчастников,мПеремСписок) Тогда
					мПеремСписок.Добавить(ПараУчастников,ПредставлениеПары,,БиблиотекаКартинок.Пары);				
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	Иначе
		мСписокВыбранных = Новый СписокЗначений;
		Для Каждого СтрПартий Из ТаблицаПартий Цикл
			Если СтрПартий.Расстановка2 <> ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
				мСписокВыбранных.Добавить(СтрПартий.Участник2);
			КонецЕсли; 
		КонецЦикла;
		Для Каждого ТекСтр Из Массив Цикл
			Искомый = мСписокВыбранных.НайтиПоЗначению(ТекСтр.Участник);
			Если Искомый = Неопределено Тогда
				мПеремСписок.Добавить(ТекСтр.Участник,Строка(ТекСтр.Участник)+" ("+ТекСтр.ТекущийРейтинг+")",,БиблиотекаКартинок.Пользователь);
			Иначе
				//мПеремСписок.Добавить(ТекСтр.Участник,Строка(ТекСтр.Участник)+" ("+ТекСтр.ТекущийРейтинг+")",,БиблиотекаКартинок.ПользовательСАутентификацией);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;

	ЭтотОбъект.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ТаблицаПартийНачалоВыбораУчастника2Завершение",
		ЭтотОбъект, Новый Структура("НомГруппы, ТекСтрока", НомГруппы, ТекСтрока)), мПеремСписок, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийНачалоВыбораУчастника2Завершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	НомГруппы = ДополнительныеПараметры.НомГруппы;
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
		
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТекСтрока.Участник2 = ВыбранныйЭлемент.Значение;
		Для каждого ТекСтрПартии Из ТаблицаПартий Цикл
			ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();
			ИДСтрПартии = ТекСтрПартии.ПолучитьИдентификатор();
			Если ИДТекСтроки <> ИДСтрПартии Тогда
				Если ТекСтрПартии.Расстановка2 = ТекСтрока.Расстановка2 Тогда
					ТекСтрПартии.Участник2 = ВыбранныйЭлемент.Значение;
					Прервать;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
		ТаблицаПартийУчастникПриИзменении(НомГруппы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийОчисткаУчастника2(Элемент, СтандартнаяОбработка)
	
	НомГруппы = ОпределитьНомерГруппыПоЭлементу(Элементы.Страницы.ТекущаяСтраница.Имя);
	ТекСтрока = Элементы.ТаблицаПартий.ТекущиеДанные;
	
	ЗначУчастника = ТекСтрока.Участник1;
	Для Каждого ТекСтр Из ТаблицаПартий Цикл
		Если ТекСтр.Участник2 = ЗначУчастника Тогда
			ТекСтр.Участник2 = Неопределено;
		КонецЕсли; 
	КонецЦикла; 
	ТаблицаПартийУчастникПриИзменении(НомГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийУчастникПриИзменении(НомГруппы)
		
	Для каждого ТекСтр Из ТаблицаПартий Цикл
		//найдем в таблице и заменим
		Отбор = Новый Структура;
		Отбор.Вставить("НомерТура",НомерТура);
		Отбор.Вставить("НомерГруппы",НомГруппы);
		Отбор.Вставить("Расстановка1",ТекСтр.Расстановка1);
		Отбор.Вставить("Расстановка2",ТекСтр.Расстановка2);
		Отбор.Вставить("Команда1",НаименованиеКоманда1);
		Отбор.Вставить("Команда2",НаименованиеКоманда2);
		Если ЗначениеЗаполнено(ТекСтр.Участник1) Или ЗначениеЗаполнено(ТекСтр.Участник2) Тогда
			МассивСтрок = ВсяТаблицаОбщихДанных.НайтиСтроки(Отбор);
			Если МассивСтрок.Количество() >  0 Тогда
				Если ТекСтр.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") И
					ТекСтр.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
					Для каждого ТекСтрМассива Из МассивСтрок Цикл
						ВсяТаблицаОбщихДанных.Удалить(ТекСтрМассива);
					КонецЦикла; 
					Для Н = 0 По 1 Цикл
						НовСтрока = ВсяТаблицаОбщихДанных.Добавить();
						НовСтрока.НомерТура		= НомерТура;
						НовСтрока.НомерГруппы	= НомГруппы;
						НовСтрока.НомерСета		= 1;
						Если ТекСтр.Участник1.Количество() > 0 Тогда
							НовСтрока.Участник1		= ТекСтр.Участник1[Н].Значение;							
						КонецЕсли; 
						Если ТекСтр.Участник2.Количество() > 0 Тогда
							НовСтрока.Участник2		= ТекСтр.Участник2[Н].Значение;
						КонецЕсли;
						НовСтрока.РежимТура		= РежимТура;
						НовСтрока.Команда1		= НаименованиеКоманда1;
						НовСтрока.Команда2		= НаименованиеКоманда2;
						НовСтрока.Расстановка1	= ТекСтр.Расстановка1;
						НовСтрока.Расстановка2	= ТекСтр.Расстановка2;
					КонецЦикла; 
				Иначе	
					Для каждого СтрМассива Из МассивСтрок Цикл
						СтрМассива.Участник1 = ТекСтр.Участник1;
						СтрМассива.Участник2 = ТекСтр.Участник2;
					КонецЦикла; 
				КонецЕсли; 
			Иначе
				Если ТекСтр.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") И
					ТекСтр.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
					Для Н = 0 По 1 Цикл
						НовСтрока = ВсяТаблицаОбщихДанных.Добавить();
						НовСтрока.НомерТура		= НомерТура;
						НовСтрока.НомерГруппы	= НомГруппы;
						НовСтрока.НомерСета		= 1;
						Если ТекСтр.Участник1.Количество() > 0 Тогда
							НовСтрока.Участник1		= ТекСтр.Участник1[Н].Значение;							
						КонецЕсли; 
						Если ТекСтр.Участник2.Количество() > 0 Тогда
							НовСтрока.Участник2		= ТекСтр.Участник2[Н].Значение;
						КонецЕсли;
						НовСтрока.РежимТура		= РежимТура;
						НовСтрока.Команда1		= НаименованиеКоманда1;
						НовСтрока.Команда2		= НаименованиеКоманда2;
						НовСтрока.Расстановка1	= ТекСтр.Расстановка1;
						НовСтрока.Расстановка2	= ТекСтр.Расстановка2;
					КонецЦикла; 
				Иначе
					//это чисто данные по жеребьевке
					НовСтрока = ВсяТаблицаОбщихДанных.Добавить();
					НовСтрока.НомерТура		= НомерТура;
					НовСтрока.НомерГруппы	= НомГруппы;
					НовСтрока.НомерСета		= 1;
					НовСтрока.Участник1		= ТекСтр.Участник1;
					НовСтрока.Участник2		= ТекСтр.Участник2;
					НовСтрока.РежимТура		= РежимТура;
					НовСтрока.Команда1		= НаименованиеКоманда1;
					НовСтрока.Команда2		= НаименованиеКоманда2;
					НовСтрока.Расстановка1	= ТекСтр.Расстановка1;
					НовСтрока.Расстановка2	= ТекСтр.Расстановка2;
				КонецЕсли; 
			КонецЕсли;
			ЭтотОбъект.Модифицированность = Истина;
		Иначе
			МассивСтрок = ВсяТаблицаОбщихДанных.НайтиСтроки(Отбор);
			Для Каждого ТекСтрМассива Из МассивСтрок Цикл
				ТекСтрМассива.Участник1		= ТекСтр.Участник1;
				ТекСтрМассива.Участник2		= ТекСтр.Участник2;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла; 
	ОбновитьАдресаТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАдресаТаблиц()
	
	ДанныеПоАдресам = ОбновитьАдресаТаблицНаСервере(ВсяТаблицаОбщихДанных,ТаблицаГруппы,ЭтотОбъект.УникальныйИдентификатор);
	АдресОбщейТаблицыДанных		= ДанныеПоАдресам.АдресОбщейТаблицыДанных;
	АдресКопииТаблицыГрупп			= ДанныеПоАдресам.АдресКопииТаблицыГрупп;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ОбновитьАдресаТаблицНаСервере(Знач ВсяТаблицаОбщихДанных,Знач ТаблицаГруппы,Уник)
	
	АдресОбщейТаблицыДанных	= ПоместитьВоВременноеХранилище(ВсяТаблицаОбщихДанных.Выгрузить(),Уник);
	АдресКопииТаблицыГрупп		= ПоместитьВоВременноеХранилище(ТаблицаГруппы.Выгрузить(),Уник);	
	Данные = Новый Структура;
	Данные.Вставить("АдресОбщейТаблицыДанных",АдресОбщейТаблицыДанных);
	Данные.Вставить("АдресКопииТаблицыГрупп",АдресКопииТаблицыГрупп);
	Возврат Данные;
	
КонецФункции
 
//ПРОЦЕДУРЫ И ФУНКЦИИ ТАБЛИЦЫ ПО ТУРАМ

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	//все данные внесем в табличную часть документа
	Если ЭтотОбъект.Модифицированность Тогда
		ЭтотОбъект.Модифицированность = Ложь;
		ОповеститьОВыборе(ВсяТаблицаОбщихДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьБезЗакрытия(Команда)
	
	Если ЭтотОбъект.Модифицированность Тогда
		ЭтотОбъект.ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(ВсяТаблицаОбщихДанных);
		ПоказатьОповещениеПользователя("Внимание",,"Данные групп успешно записаны",БиблиотекаКартинок.Информация);
		ЭтотОбъект.ЗакрыватьПриВыборе = Истина;
		ЭтотОбъект.Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)//пока не используется
	
	//Если ИмяСобытия = "ВводОчков" Тогда
	//	//форму открывали из табличного поля
	//	ПерваяСтрока = Параметр.ТаблицаШаров.НайтиПоИдентификатору(0);
	//	ВтораяСтрока = Параметр.ТаблицаШаров.НайтиПоИдентификатору(1);
	//	Если Число(ПерваяСтрока.Итог) > Число(ВтораяСтрока.Итог) Тогда
	//		перемВыигравший 		= ПерваяСтрока.Участник;
	//		стрВыигравшего			= ПерваяСтрока;
	//		
	//		перемПроигравший	= ВтораяСтрока.Участник;
	//		стрПроигравшего		= ВтораяСтрока;
	//	Иначе
	//		перемВыигравший 		= ВтораяСтрока.Участник;
	//		стрВыигравшего			= ВтораяСтрока;
	//		
	//		перемПроигравший	= ПерваяСтрока.Участник;
	//		стрПроигравшего		= ПерваяСтрока;
	//	КонецЕсли;
	//	//теперь найдем в таблице их игру и проставим победу и поражение
	//	Если Параметр.БылиИзмененыОчки Тогда //просто перезаполним ну или заново сформируем
	//		ПроставитьЗначенияВыигрышаИПроигрышаВТаблице(перемВыигравший,перемПроигравший,Параметр.НомГруппы);
	//		ЭтотОбъект.Модифицированность = Истина;
	//		ТЧДока = ТаблицаОбщихДанных;
	//		//попробуем найти эту пару
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("Выигравший",перемВыигравший);
	//		Отбор.Вставить("Проигравший",перемПроигравший);
	//		Отбор.Вставить("НомерТура",НомерТура);
	//		Отбор.Вставить("НомерГруппы",Число(Параметр.НомГруппы));
	//		ИскомыеСтроки = ТЧДока.НайтиСтроки(Отбор);
	//		Если ИскомыеСтроки.Количество() > 0 Тогда //строки уже есть перезаполняем
	//			Для Каждого ТекСтрока Из ИскомыеСтроки Цикл
	//				ТЧДока.Удалить(ТЧДока.Индекс(ТекСтрока));
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если Параметр.Технически Тогда
	//			Для Н = 1 По 3 Цикл
	//				НовСтрока = ТЧДока.Добавить();
	//				НовСтрока.РежимТура = РежимТура;
	//				НовСтрока.НомерТура = НомерТура;
	//				НовСтрока.НомерГруппы = Число(Параметр.НомГруппы);
	//				НовСтрока.НомерСета = Н;
	//				НовСтрока.Выигравший  =перемВыигравший;
	//				НовСтрока.Проигравший = перемПроигравший;
	//				НовСтрока.ОчкиВыигравшего = 1;
	//				НовСтрока.ОчкиПроигравшего= 0;
	//				НовСтрока.Техническое = Истина;
	//			КонецЦикла;
	//		Иначе
	//			Для Н = 1 По КолПартий Цикл
	//				НовСтрока = ТЧДока.Добавить();
	//				НовСтрока.РежимТура = РежимТура;
	//				НовСтрока.НомерТура = НомерТура;
	//				НовСтрока.НомерГруппы = Число(Параметр.НомГруппы);
	//				НовСтрока.НомерСета = Н;//ТекСет.НомерСета;
	//				НовСтрока.Выигравший  = перемВыигравший;
	//				НовСтрока.Проигравший = перемПроигравший;
	//				
	//				Знач1В= стрВыигравшего["Партия"+Н];
	//				Знач2П= стрПроигравшего["Партия"+Н];
	//				Если Знач1В > Знач2П Тогда //первый победил
	//					НовСтрока.КолШаров	   = Знач2П;
	//					НовСтрока.ОчкиВыигравшего = 1;
	//					НовСтрока.ОчкиПроигравшего= 0;
	//				Иначе //второй победил
	//					НовСтрока.КолШаров	   = -Знач1В;
	//					НовСтрока.ОчкиВыигравшего = 0;
	//					НовСтрока.ОчкиПроигравшего= 1;
	//				КонецЕсли;
	//			КонецЦикла;
	
	
	//Для Каждого ТекСет Из Параметр.ТаблицаШаров Цикл
				//	Если ТекСет.КолВоОчков = 0 Тогда //или не заполнен или не игрался
				//		Продолжить;
				//	КонецЕсли;
				//	НовСтрока = ТЧДока.Добавить();
				//	НовСтрока.РежимТура = РежимТура;
				//	НовСтрока.НомерТура = НомерТура;
				//	НовСтрока.НомерГруппы = Число(Параметр.НомГруппы);
				//	НовСтрока.НомерСета = ТекСет.НомерСета;
				//	НовСтрока.Выигравший  = перемВыигравший;
				//	НовСтрока.Проигравший = перемПроигравший;
				//	НовСтрока.КолШаров	   = ТекСет.КолВоОчков;
				//	Если ТекСет.КолВоОчков > 0 Тогда //это очки выигравшего
				//		НовСтрока.ОчкиВыигравшего = 1;
				//		НовСтрока.ОчкиПроигравшего= 0;
				//	Иначе
				//		НовСтрока.ОчкиВыигравшего = 0;
				//		НовСтрока.ОчкиПроигравшего= 1;
				//	КонецЕсли;
				//КонецЦикла;
	//		КонецЕсли;
	//		ОбновитьОчкиТаблицы(Параметр.НомГруппы);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	//Если ЭтотОбъект.Модифицированность Тогда
	//	Ответ = Вопрос("Данные не будут сохранены. Вы уверены что хотите закрыть форму?",РежимДиалогаВопрос.ДаНет);
	//	Если Ответ = КодВозвратаДиалога.Да Тогда
	//		ЭтотОбъект.Закрыть();
	//	КонецЕсли;
	//Иначе
		ЭтотОбъект.Закрыть();
	//КонецЕсли;
	
КонецПроцедуры
 
//ИмяЭлемента - строка из которой нужно выбрать данные
//ОпрГруппу - значение что нужно выбрать из Имени элемента
//ОпрНомерКолонки тоже самое что и ОпрГруппу
&НаКлиенте
Функция ОпределитьНомерГруппыПоЭлементу(ИмяЭлемента = "",ОпрГруппу = Ложь,ОпрНомерКолонки = Ложь)
	
	ТекСтрока = Элементы.СписокГрупп.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Возврат ТекСтрока.Значение;	
	Иначе
		Возврат 1;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура СУчетомИгр(Команда)

	ТекНомерГруппы = Число(СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя, "Группа_", ""));

	СписокГрупповыхЭтапов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("СУчетомИгрЗавершение", ЭтотОбъект),
		"Выберите тур для зачета игр в Группе № " + ТекНомерГруппы);

КонецПроцедуры

&НаКлиенте
Процедура СУчетомИгрЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ЭтапДляСУчетом = ВыбранныйЭлемент;
	Если ЭтапДляСУчетом <> Неопределено Тогда
		ДобавитьИгрыСЭтапа(ЭтапДляСУчетом.Значение);
		ЗаписатьДанные(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьИгрыСЭтапа(парНомерЭтапа)
	
	ТекНомерГруппы = Число(СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя,"Группа_",""));
	Отбор = Новый Структура;
	Отбор.Вставить("НомерТура",парНомерЭтапа);
	ТаблицаИгрВыбранногоЭтапа = СсылкаНаСоревнование.ОбщаяТаблицаДанных.Выгрузить(Отбор);
	//дальше найдем всех участников группы и их сыгранные игры в другом этапе
	Отбор2 = Новый Структура;
	Отбор2.Вставить("НомерТура",НомерТура);
	Отбор2.Вставить("НомерГруппы",ТекНомерГруппы);
	УчастникиТура = СсылкаНаСоревнование.УчастникиПоЖеребьевке.Выгрузить(Отбор2);
	УчастникиТура.Свернуть("Участник");
	МассивСтрок = УчастникиТура.ВыгрузитьКолонку("Участник");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ втОбщиеДанные Из &Внеш КАК Внеш";
	Запрос.УстановитьПараметр("Внеш",ТаблицаИгрВыбранногоЭтапа);
	Запрос.Выполнить();
	
	Текст = "ВЫБРАТЬ
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерСтроки,
	|	&НомТура КАК НомерТура,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.РежимТура,
	|	&НомГруппы КАК НомерГруппы,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.НомерСета,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Выигравший,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Проигравший,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.КолШаров,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.ОчкиВыигравшего,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.ОчкиПроигравшего,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.ТехническоеВ,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.ТехническоеП,
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.ЗачтеннаяИграГрупповой
	|ИЗ
	|	втОбщиеДанные КАК ПроведениеСоревнованияОбщаяТаблицаДанных
	|ГДЕ
	|	ПроведениеСоревнованияОбщаяТаблицаДанных.Выигравший В(&Списке)
	|	И ПроведениеСоревнованияОбщаяТаблицаДанных.Проигравший В(&Списке)";
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Списке",МассивСтрок);
	Запрос.УстановитьПараметр("НомТура",НомерТура);
	Запрос.УстановитьПараметр("НомГруппы",ТекНомерГруппы);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		МассивСтрокПоТекущейГруппе = ТаблицаОбщихДанных.НайтиСтроки(Отбор2);
		Для каждого ТекСтр Из МассивСтрокПоТекущейГруппе Цикл
			ТаблицаОбщихДанных.Удалить(ТекСтр);
		КонецЦикла; 
		Для каждого ТекСтр Из Результат Цикл
			НовСтрока = ТаблицаОбщихДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ТекСтр);
		КонецЦикла; 
	КонецЕсли;
	ЭтотОбъект.Модифицированность = Истина;
	СУчетомИгр = Истина;
	ПереоткрытьФорму = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеИгры(Команда)
	
	ТекНомерГруппы = Число(ОпределитьНомерГруппыПоЭлементу());

	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьДанныеИгрыЗавершение", ЭтотОбъект,
		Новый Структура("ТекНомерГруппы", ТекНомерГруппы)), "Все игры в группе № " + ТекНомерГруппы
		+ " будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеИгрыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекНомерГруппы = ДополнительныеПараметры.ТекНомерГруппы;
		
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("НомерГруппы",ТекНомерГруппы);
		Отбор.Вставить("НомерТура",НомерТура);
		МассивСтрок = ВсяТаблицаОбщихДанных.НайтиСтроки(Отбор);
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			ВсяТаблицаОбщихДанных.Удалить(ТекСтрока);
		КонецЦикла;
		ПереоткрытьФорму = Истина;
		ЭтотОбъект.Модифицированность = Истина;
		ЗаписатьДанные(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаБегунки(Команда)
	
	ТекНомерГруппы = Число(СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя,"Группа_",""));
	ДанныеДляФормы = Новый Структура;
	ДанныеДляФормы.Вставить("ТабДок",ПолучитьТабличныйДокументПоБегункам(ТекНомерГруппы));
	ДанныеДляФормы.Вставить("Заголовок","Бегунки для группы № "+ТекНомерГруппы);
	ДанныеДляФормы.Вставить("Ссылка",СсылкаНаСоревнование.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаВыводаНаПечать",ДанныеДляФормы,ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументПоБегункам(мНомерГруппы)
	
	ТаблицаУчастниковГруппы = ЭтотОбъект["РеквизитТаблицы_"+мНомерГруппы];
	КоличествоВГруппе = ТаблицаУчастниковГруппы.Количество();
	
	ТаблицаПорядкаИгр = Документы.ПроведениеСоревнования.ПолучитьТаблицуИгрТура(КоличествоВГруппе);
	
	Макет = Документы.ПроведениеСоревнования.ПолучитьМакет("Бегунки");
		
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСправа = 0;
	
	МассивДляПечати = Новый Массив;
	СчИгр = 1;
	СЧБегунков = 0;
	Для каждого ТекСтрокаИгры Из ТаблицаПорядкаИгр Цикл
		//печатаем только те, которые полностью заполнены	
		Попытка
			ПервыйУчастникПары = ТаблицаУчастниковГруппы.Получить(ТекСтрокаИгры.Первый-1)["РеквизитУчастник_"+мНомерГруппы];
		Исключение
		    ПервыйУчастникПары = Неопределено;
		КонецПопытки; 
		Попытка
			ВторойУчастникПары = ТаблицаУчастниковГруппы.Получить(ТекСтрокаИгры.Второй-1)["РеквизитУчастник_"+мНомерГруппы];
		Исключение
		    ВторойУчастникПары = Неопределено;
		КонецПопытки; 
		Если ПервыйУчастникПары = Неопределено Или ВторойУчастникПары = Неопределено Тогда
			Продолжить; //нет смысла его печатать	
		КонецЕсли; 
		ПервыйБегунок	= Макет.ПолучитьОбласть("ГоризонтальнаяОбластьБегунка | ПервыйБегунок");
		ПервыйБегунок.Параметры.ДатаВремя 				= Формат(СерверныеСервер.ДатаСеанса(),"ДФ=dd.MM.yy");
		ПервыйБегунок.Параметры.НазваниеСоревнования	= СсылкаНаСоревнование.НазваниеСоревнования;
		ПервыйБегунок.Параметры.НомУчастника1			= "";
		ПервыйБегунок.Параметры.НомУчастника2			= "";
		ПервыйБегунок.Параметры.НомерМатча				= СчИгр;
		ПервыйБегунок.Параметры.НомерТура				= ТекСтрокаИгры.НомерТура;
		ПервыйБегунок.Параметры.Участник1				= ОбщийКлиентСервер.СформироватьИмяИгрока(ПервыйУчастникПары);
		ПервыйБегунок.Параметры.Участник2				= ОбщийКлиентСервер.СформироватьИмяИгрока(ВторойУчастникПары);
				
		МассивДляПечати.Добавить(ПервыйБегунок);
		Если МассивДляПечати.Количество() = 2 Тогда
			Если СЧБегунков = 5 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				СЧБегунков = 0;
			КонецЕсли;
			СЧБегунков = СЧБегунков + 1;;
			ТабДок.Вывести(МассивДляПечати.Получить(0));
			ТабДок.Присоединить(МассивДляПечати.Получить(1));
			МассивДляПечати.Очистить();
		КонецЕсли;
		СчИгр = СчИгр + 1;
	КонецЦикла;
	//выводим остаток
	Если МассивДляПечати.Количество() = 1 Тогда
		ТабДок.Вывести(МассивДляПечати.Получить(0));
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если мЗакрытиеФормы Тогда
		Если ЭтотОбъект.Модифицированность Тогда
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
				"Данные не будут сохранены. Вы уверены что хотите закрыть форму?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		мЗакрытиеФормы = Ложь;
		ЭтаФорма.Закрыть();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоискУчастникаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеДляПоиска(Текст);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПоиска(мТекстПоиска = "")
	
	СписокДанных = Новый СписокЗначений;
	Если мТекстПоиска = "" Тогда
		Возврат СписокДанных;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ втДанные ИЗ &Внеш КАК Внеш";
	Запрос.УстановитьПараметр("Внеш",СсылкаНаСоревнование.УчастникиПоЖеребьевке.Выгрузить());
	Запрос.Выполнить();
	Текст = "ВЫБРАТЬ
	|	ПроведениеСоревнованияУчастникиПоЖеребьевке.НомерГруппы КАК НомерГруппы,
	|	ПроведениеСоревнованияУчастникиПоЖеребьевке.Участник КАК Участник
	|ИЗ
	|	втДанные КАК ПроведениеСоревнованияУчастникиПоЖеребьевке
	|ГДЕ
	|	ПроведениеСоревнованияУчастникиПоЖеребьевке.НомерТура = &НомерТура
	|	И ПроведениеСоревнованияУчастникиПоЖеребьевке.РежимТура = &РежимТура
	|	И ПроведениеСоревнованияУчастникиПоЖеребьевке.Участник.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроведениеСоревнованияУчастникиПоЖеребьевке.НомерГруппы,
	|	ПроведениеСоревнованияУчастникиПоЖеребьевке.Участник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерГруппы,
	|	Участник";
	Запрос.УстановитьПараметр("НомерТура",НомерТура);
	Запрос.УстановитьПараметр("РежимТура",РежимТура);
	Запрос.УстановитьПараметр("Наименование",мТекстПоиска);
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтр Из Результат Цикл
		СписокДанных.Добавить(ТекСтр.НомерГруппы,"Группа №"+ТекСтр.НомерГруппы+" "+ТекСтр.Участник);
	КонецЦикла; 
	
	Возврат СписокДанных;
	
КонецФункции

&НаКлиенте
Процедура ПоискУчастникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтотОбъект.ТекущийЭлемент = ЭтотОбъект.Элементы["Группа_"+ВыбранноеЗначение];
	
КонецПроцедуры

//------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ТаблицаГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГруппыПередУдалением(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГруппыПриАктивизацииЯчейки(Элемент)
		
	ТекЯчейка = Элемент.ТекущийЭлемент.Имя;
	НомГруппы = глТекГруппа;
		
	ВсегоУчастниковВГруппе = ТаблицаГруппы.Количество();
	Если Найти(ТекЯчейка,"Участник") > 0 Или Найти(ТекЯчейка,"НомерУчастник") > 0 
		Или Найти(ТекЯчейка,"Очки") > 0 Или Найти(ТекЯчейка,"СписокОчков") > 0 Или Найти(ТекЯчейка,"Место") > 0 Тогда
		Для Каждого ТекСтрока Из ТаблицаГруппы Цикл
			ТекСтрока.ВыделениеСтроки = Ложь;
			Для М = 1 По ВсегоУчастниковВГруппе Цикл ТекСтрока["ВыделениеКолонки"+М] = Ложь;КонецЦикла;
		КонецЦикла;		
		Возврат;
	Иначе
		Для Каждого ТекСтрока Из ТаблицаГруппы Цикл
			ТекСтрока.ВыделениеСтроки = Ложь;
			Для М = 1 По ВсегоУчастниковВГруппе Цикл ТекСтрока["ВыделениеКолонки"+М] = Ложь;КонецЦикла;
		КонецЦикла;		
	КонецЕсли;
	НомерТекКолонки = Число(СтрЗаменить(ТекЯчейка,"ТаблицаГруппыКолонкаИгры",""));
	ТекЗначение = Элемент.ТекущиеДанные["КолонкаИгры"+НомерТекКолонки];
	Если ТекЗначение = "Х" Тогда
		ТаблицаПартий.Очистить();  
		Возврат;
	КонецЕсли;
	//нужно заполнить таблицу
	ТаблицаПартий.Очистить();  
		
	Если ТекЗначение = "2" Или ТекЗначение = "" Тогда //по этой строке выигравший
		ВыигравшийИгрок		= Элемент.ТекущиеДанные.Участник;
		НомерВ							= Элемент.ТекущиеДанные.НомерУчастника;
		ПроигравшийИгрок 	= ТаблицаГруппы.Получить(НомерТекКолонки-1).Участник;
		НомерП							= ТаблицаГруппы.Получить(НомерТекКолонки-1).НомерУчастника;
	ИначеЕсли ТекЗначение = "1" Или ТекЗначение = "0" Тогда //тогда эта строка проигравший
		ПроигравшийИгрок 	= Элемент.ТекущиеДанные.Участник;
		НомерП							= Элемент.ТекущиеДанные.НомерУчастника;
		ВыигравшийИгрок  		= ТаблицаГруппы.Получить(НомерТекКолонки-1).Участник;
		НомерВ							= ТаблицаГруппы.Получить(НомерТекКолонки-1).НомерУчастника;
	КонецЕсли;
	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("Выигравший",ВыигравшийИгрок);
	ДанныеДляЗаполнения.Вставить("НомерВ",НомерВ);
	ДанныеДляЗаполнения.Вставить("Проигравший",ПроигравшийИгрок);
	ДанныеДляЗаполнения.Вставить("НомерП",НомерП);
	ДанныеДляЗаполнения.Вставить("НомГруппы",Число(НомГруппы));
	ДанныеДляЗаполнения.Вставить("НомерТура",НомерТура);
	ДанныеДляЗаполнения.Вставить("АдресОбщейТаблицыДанных",АдресОбщейТаблицыДанных);
	ДанныеДляЗаполнения.Вставить("АдресТаблицаУчастников",АдресТаблицаУчастников);
	ДанныеДляЗаполнения.Вставить("АдресКопииТаблицыГрупп",АдресКопииТаблицыГрупп);
	ДанныеДляЗаполнения.Вставить("ЖеребьевкаКоманд",ЖеребьевкаКоманд);
	ДанныеТаблички = ЗаполнениеТабличкиПартий(ДанныеДляЗаполнения);
	Для Каждого ТекСтр Из ДанныеТаблички Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПартий.Добавить(),ТекСтр);	
	КонецЦикла; 
	//выделим строки жирным шрифтом
	МассивИгрока1 = ТаблицаГруппы.НайтиСтроки(Новый Структура("Участник",ВыигравшийИгрок));
	Если МассивИгрока1.Количество() >0 Тогда
		МассивИгрока1[0]["ВыделениеСтроки"] = Истина;
		МассивИгрока1[0]["ВыделениеКолонки"+НомерП] = Истина;
	КонецЕсли;
	МассивИгрока2 = ТаблицаГруппы.НайтиСтроки(Новый Структура("Участник",ПроигравшийИгрок));
	Если МассивИгрока2.Количество() >0 Тогда
		МассивИгрока2[0]["ВыделениеСтроки"] = Истина;
		МассивИгрока2[0]["ВыделениеКолонки"+НомерВ] = Истина;
	КонецЕсли;
	ОбновитьИтоговыеОчки();
	Если ТаблицаПартий.Количество() > 0 Тогда
		СтрокаДляДанных = ТаблицаПартий[0];
		//Если Число(СуммаИтогов1) > Число(СуммаИтогов2) Тогда
			//тогда берем команду из участник1
			НаименованиеКоманда1 	= СтрокаДляДанных.Команда1;
			НаименованиеКоманда2 	= СтрокаДляДанных.Команда2;
		//Иначе
			//НаименованиеКоманда1 	= СтрокаДляДанных.Команда2;
			//НаименованиеКоманда2 	= СтрокаДляДанных.Команда1;
		//КонецЕсли;
		Если ТекЗначение = "" Тогда //игр не было
			Если Не ЗначениеЗаполнено(НаименованиеКоманда1) Тогда
				НаименованиеКоманда1 = ВыигравшийИгрок; //просто установим
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(НаименованиеКоманда2) Тогда
				НаименованиеКоманда2 = ПроигравшийИгрок; //просто установим
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.СписокГрупп.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ЗаполнитьТаблицуПоНомеруГруппы(ТекСтрока.Значение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПоНомеруГруппы(парНомерГруппы)
	глТекГруппа = парНомерГруппы;
	Данные = Новый Структура;
	Данные.Вставить("НомГруппы",парНомерГруппы);
	Данные.Вставить("НомерТура",НомерТура);
	Данные.Вставить("РежимТура",РежимТура);
	Данные.Вставить("АдресОбщейТаблицыДанных",АдресОбщейТаблицыДанных);
	Данные.Вставить("АдресТаблицаУчастников",АдресТаблицаУчастников);
	Данные.Вставить("АдресКопииТаблицыГрупп",АдресКопииТаблицыГрупп);
	Данные.Вставить("КоличествоПобедВКоманднойИгре",КоличествоПобедВКоманднойИгре);
	ДляЗаполнения = ПолучитьДанныеПоКоманде(Данные);
	ТаблицаГруппы.Очистить();
	Для каждого ТекСтр Из ДляЗаполнения Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаГруппы.Добавить(),ТекСтр);
	КонецЦикла; 
	Для Н = 1 По ТаблицаГруппы.Количество() Цикл
		Элементы["ТаблицаГруппыГруппа"+Формат(Н, "ЧГ=0")].Видимость = Истина;
	КонецЦикла; 
	Для П = ТаблицаГруппы.Количество()+1  По 25 Цикл
		Элементы["ТаблицаГруппыГруппа"+Формат(Н, "ЧГ=0")].Видимость = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийТехническое_1ПриИзменении(Элемент)
	ТекСтр = Элементы.ТаблицаПартий.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НомГруппы = ОпределитьНомерГруппыПоЭлементу();
	Если ЗначениеЗаполнено(ТекСтр.Участник1) Или ЗначениеЗаполнено(ТекСтр.Участник2) Тогда
		Если ТекСтр.Техническое1 Тогда
			ТекСтр.ОбщийРезультат2 = ОпределитьКолПартий();
			ЗаписатьПартию(ТекСтр.ПолучитьИдентификатор(),НомГруппы);
			Если ТекСтр.ОбщийРезультат1 > ТекСтр.ОбщийРезультат2 Тогда
				ТекСтр.Итог1 = 1;
				ТекСтр.Итог2 = 0;
			Иначе
				ТекСтр.Итог1 = 0;
				ТекСтр.Итог2 = 1;
			КонецЕсли;
			ОбновитьИтоговыеОчки();
			Если Число(СуммаИтогов1) = КоличествоПобедВКоманднойИгре
				Или Число(СуммаИтогов2) = КоличествоПобедВКоманднойИгре Тогда
				СписокГруппПриАктивизацииСтроки(Элементы.СписокГрупп);
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		ТекСтр.Техническое1 = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийТехническое_2ПриИзменении(Элемент)
	ТекСтр = Элементы.ТаблицаПартий.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НомГруппы = ОпределитьНомерГруппыПоЭлементу();
	Если ЗначениеЗаполнено(ТекСтр.Участник1) Или ЗначениеЗаполнено(ТекСтр.Участник2) Тогда
		Если ТекСтр.Техническое2 Тогда
			ТекСтр.ОбщийРезультат1 = ОпределитьКолПартий();
			ЗаписатьПартию(ТекСтр.ПолучитьИдентификатор(),НомГруппы);
			Если ТекСтр.ОбщийРезультат1 > ТекСтр.ОбщийРезультат2 Тогда
				ТекСтр.Итог1 = 1;
				ТекСтр.Итог2 = 0;
			Иначе
				ТекСтр.Итог1 = 0;
				ТекСтр.Итог2 = 1;
			КонецЕсли;
			ОбновитьИтоговыеОчки();
			Если Число(СуммаИтогов1) = КоличествоПобедВКоманднойИгре
				Или Число(СуммаИтогов2) = КоличествоПобедВКоманднойИгре Тогда
				СписокГруппПриАктивизацииСтроки(Элементы.СписокГрупп);
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		ТекСтр.Техническое2 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьРасстановку(Команда)
	
	НомГруппы = ОпределитьНомерГруппыПоЭлементу();
	МассивСтрок = ВсяТаблицаОбщихДанных.НайтиСтроки(Новый Структура("НомерГруппы",НомГруппы));
	Если МассивСтрок.Количество() > 0 Тогда
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить("УдалитьЖеребьевку","Удалить жеребьевку");
		ЕстьСыгранныеИгры = Ложь; //проверим таблицу, так как это может быть просто жеребьевка
		Для Каждого ТекСтр Из МассивСтрок Цикл
			Если ТекСтр.ОчкиВыигравшего > 0 Или ТекСтр.ОчкиПроигравшего > 0 Тогда
				ЕстьСыгранныеИгры = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		Если Не ЕстьСыгранныеИгры Тогда
			СписокОтветов.Добавить("ПоменятьМестами","Поменять местами");
		КонецЕсли; 
		//СписокОтветов.Добавить("УдалитьЖеребьевкуИПоменятьМестами","Удалить жеребьевку и поменять расстановку");
		СписокОтветов.Добавить("Отмена","Отмена");

		ПоказатьВопрос(Новый ОписаниеОповещения("ПоменятьРасстановкуЗавершение", ЭтотОбъект, Новый Структура("МассивСтрок, НомГруппы", МассивСтрок, НомГруппы)), "У этих команд уже есть данные, по жеребьевке участников.",СписокОтветов); 
	Иначе
		ПоменятьРасстановкуКомандИОбновитьФорму();		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьРасстановкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	НомГруппы = ДополнительныеПараметры.НомГруппы;
	
	
	Ответ = РезультатВопроса;
	Если Ответ = "УдалитьЖеребьевкуИПоменятьМестами" Или Ответ = "УдалитьЖеребьевку" Или Ответ = "ПоменятьМестами" Тогда //меняем местами
		Если Ответ = "УдалитьЖеребьевку" Тогда
			Для Каждого ТекСтр Из МассивСтрок Цикл //удаляем 
				ВсяТаблицаОбщихДанных.Удалить(ТекСтр);
			КонецЦикла;
		КонецЕсли; 
		Если Ответ = "ПоменятьМестами" Тогда
			Для Каждого ТекСтр Из МассивСтрок Цикл //меняем местами
				втУч1		= ТекСтр.Участник1;
				втУч2		= ТекСтр.Участник2;
				втКом1	= ТекСтр.Команда1;
				втКом2	= ТекСтр.Команда2;
				
				ТекСтр.Участник1 	= втУч2;
				ТекСтр.Участник2	= втУч1;
				ТекСтр.Команда1	= втКом2;
				ТекСтр.Команда2	= втКом1;
			КонецЦикла;
			ПоменятьРасстановкуКомандИОбновитьФорму(); //меняем расстановку				
		КонецЕсли;
		ОбновитьАдресаТаблиц();
		//перезаполняем табличку партий
		//ДанныеИгры = Новый Структура;	
		//ДанныеИгры.Вставить("Игрок1",НаименованиеКоманда1);
		//ДанныеИгры.Вставить("Игрок2",НаименованиеКоманда2);
		//ДанныеИгры.Вставить("КолПартий",КолПартий);
		//ЗаполнениеТабличкиПартий(ДанныеИгры);
		
		ДанныеДляЗаполнения = Новый Структура;
		ДанныеДляЗаполнения.Вставить("Выигравший",НаименованиеКоманда1);
		ДанныеДляЗаполнения.Вставить("Проигравший",НаименованиеКоманда2);
		ДанныеДляЗаполнения.Вставить("НомГруппы",Число(НомГруппы));
		ДанныеДляЗаполнения.Вставить("НомерТура",НомерТура);
		ДанныеДляЗаполнения.Вставить("АдресОбщейТаблицыДанных",АдресОбщейТаблицыДанных);
		ДанныеДляЗаполнения.Вставить("АдресТаблицаУчастников",АдресТаблицаУчастников);
		ДанныеДляЗаполнения.Вставить("АдресКопииТаблицыГрупп",АдресКопииТаблицыГрупп);
		ДанныеДляЗаполнения.Вставить("ЖеребьевкаКоманд",ЖеребьевкаКоманд);
		ДанныеТаблички = ЗаполнениеТабличкиПартий(ДанныеДляЗаполнения);
		ТаблицаПартий.Очистить();
		Для Каждого ТекСтр Из ДанныеТаблички Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПартий.Добавить(),ТекСтр);	
		КонецЦикла; 
		ТаблицаПартий.Сортировать("НомерСтроки ВОЗР");
		ЭтотОбъект.Модифицированность = Истина;
		////выделим строки жирным шрифтом
		//МассивИгрока1 = ТаблицаГруппы.НайтиСтроки(Новый Структура("Участник",ВыигравшийИгрок));
		//Если МассивИгрока1.Количество() >0 Тогда
		//	МассивИгрока1[0]["ВыделениеСтроки"] = Истина;
		//	МассивИгрока1[0]["ВыделениеКолонки"+НомерП] = Истина;
		//КонецЕсли;
		//МассивИгрока2 = ТаблицаГруппы.НайтиСтроки(Новый Структура("Участник",ПроигравшийИгрок));
		//Если МассивИгрока2.Количество() >0 Тогда
		//	МассивИгрока2[0]["ВыделениеСтроки"] = Истина;
		//	МассивИгрока2[0]["ВыделениеКолонки"+НомерВ] = Истина;
		//КонецЕсли;
		НаименованиеКоманда1 	= ДанныеДляЗаполнения.Выигравший;
		НаименованиеКоманда2 	= ДанныеДляЗаполнения.Проигравший;
		ОбновитьИтоговыеОчки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоменятьРасстановкуКомандИОбновитьФорму()
	
	втНаименованиеКоманда1 = НаименованиеКоманда1;
	втНаименованиеКоманда2 = НаименованиеКоманда2;
	
	НаименованиеКоманда1 = втНаименованиеКоманда2;
	НаименованиеКоманда2 = втНаименованиеКоманда1;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийИтог1Очистка(Элемент, СтандартнаяОбработка)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ТаблицаПартийИтог1ОчисткаЗавершение", ЭтотОбъект), "Текущая встреча будет удалена.Продолжить?",РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийИтог1ОчисткаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТекСтрока = Элементы.ТаблицаПартий.ТекущиеДанные;
		ОтборДанных = Новый Структура;
		ОтборДанных.Вставить("НомерТура",НомерТура);
		ОтборДанных.Вставить("НомерГруппы",ОпределитьНомерГруппыПоЭлементу());
		ОтборДанных.Вставить("Команда1",НаименованиеКоманда1);
		ОтборДанных.Вставить("Команда2",НаименованиеКоманда2);
		ОтборДанных.Вставить("Расстановка1",ТекСтрока.Расстановка1);
		ОтборДанных.Вставить("Расстановка2",ТекСтрока.Расстановка2);
		Если ТекСтрока.Расстановка1 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара")
			Или ТекСтрока.Расстановка2 = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара") Тогда
		Иначе
			ОтборДанных.Вставить("Участник1",ТекСтрока.Участник1);
			ОтборДанных.Вставить("Участник2",ТекСтрока.Участник2);
		КонецЕсли;
		МассивСтрок = ВсяТаблицаОбщихДанных.НайтиСтроки(ОтборДанных);
		Для Каждого ТекСтр Из МассивСтрок Цикл
			ТекСтр.КолШаров					= 0;
			ТекСтр.ОчкиВыигравшего	= 0;
			ТекСтр.ОчкиПроигравшего	= 0;
			ТекСтр.ТехническоеВ			= Ложь;
			ТекСтр.ТехническоеП			= Ложь;
		КонецЦикла;
		Для Н = 1 По 2 Цикл
			ТекСтрока["Техническое"+Н] = Ложь;
			ТекСтрока["Итог"+Н] = 0;
			ТекСтрока["ОбщийРезультат"+Н] = 0;
		КонецЦикла;
		Для П = 1 По 7 Цикл
			ТекСтрока["Игра"+П] = "";
		КонецЦикла;
		ОбновитьИтоговыеОчки();
		ЭтотОбъект.Модифицированность = Истина;
		ОбновитьАдресаТаблиц();
		СписокГруппПриАктивизацииСтроки(Элементы.СписокГрупп);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПротокол(Команда)
	Искомая = СсылкаНаСоревнование.ХодСоревнованияКоманды.НайтиСтроки(Новый Структура("НомерСтроки",НомерТура));
	Если Искомая.Количество() > 0 Тогда
		ПараметрыСтроки = Новый Структура;
		ПараметрыСтроки.Вставить("НомерСтроки",НомерТура);
		ПараметрыСтроки.Вставить("РежимТура",Искомая[0].РежимТура);
		ПараметрыСтроки.Вставить("КолПартий",Искомая[0].КолПартий);
		ПараметрыСтроки.Вставить("Комментарий",Искомая[0].Комментарий);
		ПараметрыСтроки.Вставить("Жеребьевка",Искомая[0].Жеребьевка);
		ОткрытьФорму("ОбщаяФорма.ФормаВыводаНаПечать",Новый Структура("ТабДок,Заголовок,Ссылка",ФормированиеТаблицГруппКоманд(ПараметрыСтроки),Искомая[0].Комментарий,СсылкаНаСоревнование.Ссылка),ЭтотОбъект,Новый УникальныйИдентификатор);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ФормированиеТаблицГруппКоманд(парСтроки)
	
	мДокОбъектЗнач = РеквизитФормыВЗначение("СсылкаНаСоревнование");
	мДокОбъект = мДокОбъектЗнач.Скопировать();
	мДокОбъект.ОбщаяТаблицаДанныхПоКомандам.Очистить();
	Для каждого ТекСтр Из ВсяТаблицаОбщихДанных Цикл
		ЗаполнитьЗначенияСвойств(мДокОбъект.ОбщаяТаблицаДанныхПоКомандам.Добавить(),ТекСтр);
	КонецЦикла; 
	
	Возврат Документы.ПроведениеСоревнования.ФормированиеТаблицГруппКоманд(парСтроки,Истина,мДокОбъект);
	
КонецФункции



