
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПодтверждениеПароля = Пароль;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	Если ЗаписатьНаСервере() Тогда
		ПоказатьОповещениеПользователя("Добавлен",,"Добавлен новый пользователь "+ПолноеИмя,БиблиотекаКартинок.Информация);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	Искомый = ПользователиИнформационнойБазы.НайтиПоИмени(ПолноеИмя);
	Если Искомый = Неопределено Тогда
		НовПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовПользователь.ПолноеИмя = ПолноеИмя;
		НовПользователь.Имя = Имя;
		НовПользователь.Пароль = Пароль;
		НовПользователь.ПоказыватьВСпискеВыбора = Истина;
		НовПользователь.АутентификацияСтандартная = Истина;
		НовПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		НовПользователь.Записать();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
