
Функция НайтиКэфПоСчету(парДата, СчетВыигравшего, СчетПроигравшего) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата", парДата);
	Запрос.УстановитьПараметр("СчетВ", СчетВыигравшего);
	Запрос.УстановитьПараметр("СчетП", СчетПроигравшего);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КоэффициентыРейтингаПоСчетуВстречиСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.КоэффициентыРейтингаПоСчетуВстречи.СрезПоследних(&ТекДата, СчетВыигравшего = &СчетВ
	|	И СчетПроигравшего = &СчетП) КАК КоэффициентыРейтингаПоСчетуВстречиСрезПоследних";

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Коэффициент;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции