
&НаКлиенте
Процедура ПорядокВстречВариантABCПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПорядокВстреч.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТекСтрока.ВариантABC) И ЗначениеЗаполнено(ТекСтрока.ВариантXYZ) Тогда
		ВариантПара = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.Пара");
		//проверяем на пары
		Если ТекСтрока.ВариантABC = ВариантПара	Или ТекСтрока.ВариантXYZ = ВариантПара Тогда
			//тогда они должны быть обе парами
			Если ТекСтрока.ВариантABC <> ТекСтрока.ВариантXYZ Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для пары должна быть указана только пара";
				Сообщение.Поле = "ПорядокВстреч["+Объект.ПорядокВстреч.Индекс(ТекСтрока)+"]."+Элемент.Имя; //имя реквизита 
				Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
				Сообщение.Сообщить();
				Если ТекСтрока.ВариантABC <> ВариантПара Тогда
					ТекСтрока.ВариантABC = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.ПустаяСсылка");
				КонецЕсли; 
				Если ТекСтрока.ВариантXYZ <> ВариантПара Тогда
					ТекСтрока.ВариантXYZ = ПредопределенноеЗначение("Перечисление.ВариантыРасстановки.ПустаяСсылка");
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокВстречПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	Если Копирование Тогда
	Иначе
		НовСтрока = Объект.ПорядокВстреч.Добавить();
		РассчитатьПримерноеКоличествоПобед();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПримерноеКоличествоПобед()
	
	КолСтрок = Объект.ПорядокВстреч.Количество();
	втПобед = Окр(КолСтрок/2,0,РежимОкругления.Окр15как20);
	Объект.КоличествоПобед = втПобед;
	
КонецПроцедуры
 
