
&НаКлиенте
Процедура КомандаПодбор(Команда)
	Данные = Новый Структура;
	Данные.Вставить("Соревнование",втДокОбъект);
	Данные.Вставить("Новый",Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбора",ЭтотОбъект);	
	ОткрытьФорму("Документ.ПроведениеСоревнования.Форма.ПодборУчастников",Данные,ЭтотОбъект,Новый УникальныйИдентификатор,,,ОписаниеОповещения,Серверные.ПолучитьРежимОткрытияФормыПодбора());
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбора(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для Каждого ТекСтрока Из Результат Цикл
			НовСтрока = Объект.Данные.Добавить();
			НовСтрока.Игрок = ТекСтрока.Участник;
			НовСтрока.Рейтинг = ТекСтрока.Рейтинг;
		КонецЦикла;
		Если Объект.Данные.Количество() > 0 Тогда
			ЭтотОбъект.Модифицированность = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
 
