
&НаКлиенте
Процедура КинутьЖребий(Команда)
	КинутьЖребийНаСервере();
КонецПроцедуры

&НаСервере
Процедура КинутьЖребийНаСервере()
	
	Элементы.ЛеваяКартинка.Картинка = Новый Картинка;
	Элементы.ПраваяКартинка.Картинка = Новый Картинка;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	ЧислоСтороны = ГСч.СлучайноеЧисло(0,1);
	Если ЧислоСтороны = 0 Тогда
		Элементы.ЛеваяКартинка.Картинка = БиблиотекаКартинок.МонеткаДляЖеребьевкиБольшая;
	Иначе
		Элементы.ПраваяКартинка.Картинка = БиблиотекаКартинок.МонеткаДляЖеребьевкиБольшая;
	КонецЕсли;
	
КонецПроцедуры
