
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ДанныеДляФормы = Новый Структура("ТабДок",ТабличныйДокументРейтинг(ПараметрКоманды));
	Если ПараметрКоманды.Количество() = 1 Тогда
		ДанныеДляФормы.Вставить("Заголовок",Серверные.ПолучитьЗаголовокПоСоревнованию(ПараметрКоманды[0]));
		ДанныеДляФормы.Вставить("Ссылка",ПараметрКоманды[0]);
	Иначе
		ДанныеДляФормы.Вставить("Заголовок","Список рейтинга");
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.ФормаВыводаНаПечать",ДанныеДляФормы,ПараметрыВыполненияКоманды.Источник,ПараметрыВыполненияКоманды.Уникальность,ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

&НаСервере
Функция ТабличныйДокументРейтинг(ДокСсылки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСоревнований",ДокСсылки);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПроведениеСоревнования.Ссылка,
	|	ПроведениеСоревнования.Дата КАК Дата
	|ИЗ
	|	Документ.ПроведениеСоревнования КАК ПроведениеСоревнования
	|ГДЕ
	|	ПроведениеСоревнования.Ссылка В(&СписокСоревнований)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Результат = Запрос.Выполнить().Выгрузить();
	
	глТабДок = Новый ТабличныйДокумент;
	Для каждого ТекДок Из Результат Цикл
		мТабДок = Документы.ПроведениеСоревнования.ТабличныйДокументРейтинг(ТекДок.Ссылка);
		Если глТабДок.ПроверитьВывод(мТабДок) Тогда
			глТабДок.Вывести(мТабДок);
		Иначе
			глТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			глТабДок.Вывести(мТабДок);			
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат глТабДок;
	
КонецФункции

