
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицу();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	ТаблицаНастроек.Очистить();
	//пока сделаем все стандартно, для 8 мест
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиСбораГрупп.НомерГруппы,
	|	НастройкиСбораГрупп.СМеста,
	|	НастройкиСбораГрупп.ПоМесто
	|ИЗ
	|	РегистрСведений.НастройкиСбораГрупп КАК НастройкиСбораГрупп";
	Результат= Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Для каждого ТекСтр Из Результат Цикл
			НовСтрока = ТаблицаНастроек.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ТекСтр);
		КонецЦикла; 	
	Иначе
		ПоследнееМесто = 1;
		Для н = 1 По 4 Цикл
			НовСтрока = ТаблицаНастроек.Добавить();
			НовСтрока.СМеста	 = ПоследнееМесто;
			ПоследнееМесто = ПоследнееМесто + 1;
			НовСтрока.ПоМесто	 = ПоследнееМесто;
			ПоследнееМесто = ПоследнееМесто + 1;
			НовСтрока.НомерГруппы = н;
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СобратьГруппы(Команда)
	ОповеститьОВыборе(ТаблицаНастроек);
КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияСписка",ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкиСбораГрупп.ФормаСписка",,ЭтотОбъект,,,,ОписаниеЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияСписка(Результат,ДопПараметры)
	ЗаполнитьТаблицу();
КонецПроцедуры
 
