
//процедура заполняет или перезаполняет все шаблоны
Процедура ЗаполнитьШаблоныЖеребьевок() Экспорт
	
	ВР = Перечисления.ВариантыРасстановки;
	
	//Приложение 6.1
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение61.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.1";
	ОбъектПриложения.КоличествоПобед = 3;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ОбъектПриложения.Записать();
	
	//Приложение 6.2
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение62.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.2";
	ОбъектПриложения.КоличествоПобед = 3;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.Пара,ВР.Пара);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ОбъектПриложения.Записать();
	
	//Приложение 6.4
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение64.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.4";
	ОбъектПриложения.КоличествоПобед = 4;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.Пара,ВР.Пара);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Z);
	ОбъектПриложения.Записать();
	
	//Приложение 6.5
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение65.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.5";
	ОбъектПриложения.КоличествоПобед = 5;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Z);
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Y);
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ОбъектПриложения.Записать();
	
КонецПроцедуры
 
Процедура ДобавитьСтрокуПорядкаВстреч(Таблица,ABC,XYZ)
	
	НовСтрока = Таблица.Добавить();
	НовСтрока.ВариантABC = ABC;
	НовСтрока.ВариантXYZ = XYZ;
	
КонецПроцедуры
