
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Адрес") Тогда
		Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		ИсточникВызова = Параметры.ИсточникВызова;
		Для каждого ТекСтр Из Данные Цикл
			НовСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ТекСтр);
		КонецЦикла; 
	КонецЕсли; 
	Параметры.Свойство("ТаблицаВызова",ТаблицаВызова);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьУчастника(Команда)
	
	ТекСтрока = Элементы.Таблица.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Выбран = Истина;
		ОповеститьОВыборе(ТекСтрока);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьУчастника(Неопределено);
КонецПроцедуры

