
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = "Положение о формулах";
	СписокПеременных.Добавить("РТв","РТв");
	СписокПеременных.Добавить("РТп","РТп");
			
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	НачатьЗапускПриложения(Неопределено, "http://ttfr.ru/index.html?layer_id=1&id=270&nav_id=286");
КонецПроцедуры

&НаКлиенте
Процедура СписокПеременныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Запись.Формула  = Запись.Формула+СписокПеременных.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение;
	
КонецПроцедуры

                                                                                        