
Процедура ПриНачалеРаботыСистемы()
	
	Клиентские.ДействияПриНачалеРаботыСистемыКлиент();
	ТекстСообщения = Серверные.ПроверкаВерсииПлатформы();
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Серверные.УстановитьПараметрыСеанса();
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	Отказ = Истина;
	ТекстПредупреждения = "Завершить работу с программой ?";
	
КонецПроцедуры