
&НаКлиенте
Процедура КомндаСформировать(Команда)
	
	СформироватьОтчетНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Если Участник = Справочники.Участники.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок.Очистить();
	мОбъект = РеквизитФормыВЗначение("Отчет");
	Данные = Новый Структура;
	Данные.Вставить("Участник",Участник);
	Данные.Вставить("ВидРейтинга",ВидРейтинга);
	Данные.Вставить("НачалоПериода",Период.ДатаНачала);
	Данные.Вставить("КонецПериода",Период.ДатаОкончания);
	Адрес = ПоместитьВоВременноеХранилище(Данные);
	ТабДок.Вывести(мОбъект.СформироватьКарточкуУчастника(Адрес));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Участник") Тогда
		Участник = Параметры.Участник;
	КонецЕсли;

	ОбновитьПериодПоУчастнику();
	
	ВидРейтинга = Константы.ВидРейтинга.Получить();
	Если Участник <> Справочники.Участники.ПустаяСсылка() И Параметры.СформироватьПриОткрытии Тогда
		СформироватьОтчетНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодПоУчастнику()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Участник", Участник);
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(ПроведениеСоревнованияСписокУчастников.Ссылка.Дата) КАК МинДата,
	|	МАКСИМУМ(ПроведениеСоревнованияСписокУчастников.Ссылка.Дата) КАК МаксДата
	|ПОМЕСТИТЬ втДаты
	|ИЗ
	|	Документ.ПроведениеСоревнования.СписокУчастников КАК ПроведениеСоревнованияСписокУчастников
	|ГДЕ
	|	ПроведениеСоревнованияСписокУчастников.Участник = &Участник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втДаты.МинДата, ДАТАВРЕМЯ(1, 1, 1)) КАК МинДата,
	|	ЕСТЬNULL(втДаты.МаксДата, ДАТАВРЕМЯ(1, 1, 1)) КАК МаксДата
	|ИЗ
	|	втДаты КАК втДаты";
	ЗапросДат = Запрос.Выполнить().Выгрузить();
	Если ЗапросДат.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(ЗапросДат[0].МинДата) Тогда
			Период.ДатаНачала 			= ЗапросДат[0].МинДата;
		Иначе
			Период.ДатаНачала 			= НачалоГода(ТекущаяДатаСеанса());
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗапросДат[0].МаксДата) Тогда
			Период.ДатаОкончания 			= ЗапросДат[0].МаксДата;
		Иначе
			Период.ДатаОкончания 			= КонецГода(ТекущаяДатаСеанса());
		КонецЕсли;
	Иначе
		Период.ДатаНачала 			= НачалоГода(ТекущаяДатаСеанса());
		Период.ДатаОкончания 	= КонецГода(ТекущаяДатаСеанса());
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
	ОбновитьПериодПоУчастнику();
КонецПроцедуры
