
&НаКлиенте
Процедура КомндаСформировать(Команда)
	
	СформироватьОтчетНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Если Участник = Справочники.Участники.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок.Очистить();
	мОбъект = РеквизитФормыВЗначение("Отчет");
	Данные = Новый Структура;
	Данные.Вставить("Участник",Участник);
	Данные.Вставить("ВидРейтинга",ВидРейтинга);
	Данные.Вставить("НачалоПериода",Период.ДатаНачала);
	Данные.Вставить("КонецПериода",Период.ДатаОкончания);
	Адрес = ПоместитьВоВременноеХранилище(Данные);
	ТабДок.Вывести(мОбъект.СформироватьКарточкуУчастника(Адрес));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Участник") Тогда
		Участник = Параметры.Участник;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Участник", Участник);
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(ПроведениеСоревнованияСписокУчастников.Ссылка.Дата) КАК МинДата,
	|	МАКСИМУМ(ПроведениеСоревнованияСписокУчастников.Ссылка.Дата) КАК МаксДата
	|ИЗ
	|	Документ.ПроведениеСоревнования.СписокУчастников КАК ПроведениеСоревнованияСписокУчастников
	|ГДЕ
	|	ПроведениеСоревнованияСписокУчастников.Участник = &Участник";
	ЗапросДат = Запрос.Выполнить().Выгрузить();
	Если ЗапросДат.Количество() > 0 Тогда
		Период.ДатаНачала 			= ЗапросДат[0].МинДата;
		Период.ДатаОкончания 	= ЗапросДат[0].МаксДата;
	Иначе
		Период.ДатаНачала 			= НачалоГода(ТекущаяДата());
		Период.ДатаОкончания 	= КонецГода(ТекущаяДата());
	КонецЕсли; 
	
	ВидРейтинга = Константы.ВидРейтинга.Получить();
	Если Участник <> Справочники.Участники.ПустаяСсылка() И Параметры.СформироватьПриОткрытии Тогда
		СформироватьОтчетНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидРейтингаПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры
